{
  "name": "Abramsky Hall",
  "coords": [44.2255534, -76.489364],
  "addr": "21 Arch Street",
  "images": ["./public/images/buildings/abramsky-hall-0.jpg"],
  "alts": ["[Abramsky Hall]"],
  "desc": [
    "Completed in 1957, this neo-Georgian building at the corner of Arch and Deacon Streets was the first building on campus dedicated to the study of the science of physiology and initially was called the Physiology Building.",
    "A plaque erected inside the entrance recognizes the generous gift from local businessman Harry Abramsky and his wife Ethel who donated the funds for its construction. In 1974, on the recommendation of Principal Ronald Watts, the building was renamed in their honour.",
    "The Physiology Department has since moved, and the building now houses a variety of health-related academic units. It is designed in the neo-Georgian style and clad in Queenston limestone.",
    "In 2011, Queen's School of Medicine incorporated the south exterior wall of Abramsky Hall.",
    " ",
    " "
  ],
  "desc_src": "https://www.queensu.ca/encyclopedia/a/abramsky-hall",
  "access": [
    " ",
    "Location: Abramsky Hall is located on Arch Street just south of the Biosciences Complex.",
    "Entrances",
    "North (accessible entrance):\nThe accessible entrance to Abramsky Hall is on the North side of the building. Use Deacon Walk, the pathway between Abramsky Hall and the Biosciences Complex. This entrance requires prior arrangements. The automatic door opens to a landing where a wheelchair lift is installed.",
    "West (main entrance):\nThe main entrance to Abramsky Hall off Arch Street is not accessible, it has stairs leading up to it.",
    "Corridors: There are some heavy doors that act as barriers in the corridors.",
    "Elevators: The elevator can be located following the hallway to the Arch Street entrance. It is very small (57” by 40” with a door that opens to 36”) and you have to back into it. There are no mirrors in the elevator to help with backing in. Further, the elevator is not equipped with an audible system. However, the buttons are in Braille. Safety note: Check that the elevator floor is level with the hall floor before entering.",
    "Lifts: The lift measures 45” wide and 66” long, with an entrance that measures 36”. It requires a key. If you are a regular building user, a key can be made available. If you have a meeting or class in this building, you will have to arrange to be met at the door. There is no phone at the wheelchair lift. The lift can be used to access the basement and first floor from North accessible entrance. On each level there is a heavy door in the hallway that does not have an automatic opener.",
    "Wayfinding: The signage for this building it to the left side of the entrance, high up on the exterior wall.",
    "Washrooms: Single user accessible washrooms are located on levels 1 (rooms: 114 & 115), level 2 (room: 217) and level 3 (rooms: 322 & 323) but do not have power doors. Some of the doors to the washrooms are heavy to push open.",
    "Services: This building has offices for several different units, including but not limited to; the Office of Global Health, Centre for Health Services and Policy Research, Medical Education Technology Unit.",
    "Parking: Permit parking is available in the parking lot on the south side of the building and on Arch Street. There is time-limited parking on Barrie, Court and Bagot Streets and one accessible meter space on Stuart Street at George Street.",
    "Water Fountain: There is an accessible water fountain and bottle fill station on level 1, next to the elevator.",
    " ",
    "Link to Abramsky Hall on the Queen's Campus Map",
    "Link to Abramsky Hall on Google Maps",
    "Link to Abramsky Hall Floor Plans",
    "Link to Abramsky Hall Site Plans"
  ],
  "map": "https://goo.gl/maps/8mx9vaDM1cQD9cGr7"
}
