{"name": "Agnes Etherington Art Centre", "coords": [44.225358400000005, -76.4962824931659], "addr": "36 University Ave", "images": [{"src": "/images/buildings/agnes-etherington-art-centre-0.jpg", "alt": "[photo of the Agnes Etherington Art Centre in 1962]"}, {"src": "/images/buildings/agnes-etherington-art-centre-1.jpg", "alt": "[photo of the Agnes Etherington Art Centre]"}], "desc": ["\"The Agnes\" is one of Canada's most respected art museums, with a permanent collection of more than 14,000 pieces.", "The collection ranges from the 14th century to the present, with an emphasis on Canadian art. It includes paintings, sculptures, and graphics by major Canadian artists, European old master paintings, costumes, quilts, silver and other decorative objects, Inuit art, and one of the largest public collections of African art in Canada.", "Exhibitions from the permanent collection are complemented by travelling exhibitions and a variety of public programs.", "The centre opened in 1957 in the home of Frederick and Agnes Richardson Etherington (1880-1954). Frederick had been dean of medicine; Agnes had been instrumental in establishing Queen's fine art program.", "In 1926, Mrs. Etherington was part of the formation of the Kingston Art and Music Club. She continued to work for the arts throughout her life and, in her final years, drew up plans to bequeath her house to Queen's \"for the furtherance of art and music and for the exhibition of pictures and music.\"", "The red-brick house, built in Victorian style for the Richardson family in 1879 and remodelled as a Georgian-style building in the 1920s, still contains many of the Etheringtons' elegant furnishings. It is located on University Avenue opposite Grant Hall.", "In 1962, a large modern addition was built, giving the centre a total of seven exhibition galleries and a studio. Further extensions were made in 1975 and 1978, and in 1998 the Art Centre was temporarily re-located to Mcgillivray-Brown Hall to make room for the $7.2 million renovations of the permanent building.", "In 2000, the Agnes moved back into its original home, complete with a refurbished gallery that features up-to-date collections, enlarged storage, studio and volunteer space, improved climate control, better visibility, and improved public amenities such as the André Biéler Studio, the Atrium, a new reception area, a Rental and Sales Gallery, and a Gallery Shop.", "The Agnes Etherington Art Centre and it's collection is the product of many decades of vision and generosity. Queen's commitment to the visual arts became apparent in the 1930s when Swiss-born painter André Biéler was appointed resident artist. He later became the founding director of the Agnes. At the same time, prominent alumni pooled their resources under the auspices of the Queen's Art Foundation and donated canvases for display on campus.", "In 1942, a seminal conference on Canadian art brought the country's leading artists to Queen's to debate their craft.", "The crystallizing moment came in 1957 when the Etherington house was bequeathed as the kernel of a campus art gallery.", "Over the years, the centre has been guided by a succession of insightful directors: André Biéler was followed in 1963 by modernist painter Ralph Allen, in turn succeeded by Michael Bell, David McTavish, Janet Brooke, Jan Allen and in 2020, Emelie Chhangur.", "Their work has been reinforced by the university's willingness to underwrite major expansions of the centre, thereby adding new exhibition and curatorial space.", "Frances K. Smith, who joined the newly opened centre in 1957 as curator, was integral to its growth and success. She spent the next 23 years helping to build up the permanent art collection, researching and cataloguing all the artwork at Queen's, planning exhibitions, pursuing funds, and publishing numerous articles. She retired as curator emeritus in 1980. A gallery in the Agnes is named for her.", "The centre also benefited from the generosity of private donors, whose donations of art and funds have given its collections and staff a global reputation. In the 1960s, financier Samuel Zacks and his wife Ayala donated a wide-ranging collection of contemporary Canadian art. In 1984, Montrealers Justin and Elisabeth Lang endowed Queen's with an extensive collection of African art. And the Bader Collection (including four works by Rembrandt) gifts of Drs Aldred and Isabel Bader and family, have given the Agnes one of the largest and best-regarded collections of European art in Canada.", "Learn more: Agnes Etherington Art Centre..."], "location": "The Agnes Etherington Art Centre is located on University Avenue at the corner of Bader Lane.", "entrances": ["East (Main & Accessible entrance):\nThe main entrance is accessible with a ramp from University Avenue and automatic door openers. The Agnes Etherington House is accessible from the Art Centre by a ramp with railings on each side."], "corridors": "There are some doors that act as barriers in the corridors. But all gallery doors have automatic openers.", "wayfinding": "There is freestanding signage leading up to the building and a large sign above the entranceway.", "washrooms": "Accessible public washrooms are located off the main lobby. They do not have automatic door openers. Men’s and Women’s bathrooms on the main floor are equipped with change tables. There are 2 gender neutral washrooms located from within Etherington House (rooms: 214 & 215), they are not accessible because they are located on the second floor up a large set of stairs.", "fountains": "", "classrooms": "", "elevators": "", "services": "There is a front desk parallel to the main entrance where staff can offer assistance if needed.", "parking": "Permit parking available on Bader Lane. Visitor parking is available at the underground parking garage on Stuart Street at University Avenue. There are three accessible pay parking on Stuart Street opposite the underground parking entrance under Nixon Field.", "desc_src": "https://www.queensu.ca/encyclopedia/a/agnes-etherington-art-centre", "access": [], "map": "https://goo.gl/maps/WRXBgM1es3BA21fR8"}