{
  "name": "ASUS Offices",
  "coords": [44.2293146, -76.4954081],
  "addr": "183 University Ave",
  "images": [
    "/images/buildings/arts-and-science-undergraduate-society-asus-0.jpg"
  ],
  "alts": ["[photo of ASUS Logo"],
  "desc": [
    "",
    "The Arts and Science Undergraduate Society is the student governing body of the Faculty of Arts and Science. The Society was founded in 1891 and is one of the oldest faculty societies in Canada.",
    "The ASUS mandate is to provide opportunities for students outside of the classroom to enrich their experience at Queen's University as an Arts and Science undergraduate.",
    "The ASUS President reports to the Dean of Arts and Science and represents the Faculty on the President's Caucus, which is comprised of the President of every Faculty Society.",
    "Learn more about ASUS..."
  ],
  "desc_src": "https://www.queensu.ca/encyclopedia/a/arts-and-science-undergraduate-society-asus",
  "access": [
    "Location: 183 University Avenue is located north of Stauffer Library, south of Earl St.",
    "Entrances",
    "South (accessible entrance)\nThe accessible entrance to this building is located by a ramp on the south side of the building.",
    "West (main entrance)\nThe main entrance is located on the west side of the building with a set of stairs leading up to it.",
    "Corridors: There are doors that act as barriers in the corridors. Hallways and doorways are generally narrow. The 2nd floor and the basement are inaccessible because there is no elevator in this building.",
    "Wayfinding: The signage for this building is located beside the door of the main entrance.",
    "Washrooms: There is one single-user accessible washroom on the main floor. All washrooms in the building are single user.",
    "Services: Arts and Science Undergraduate Society (ASUS) is located within this building.",
    "Parking: Permit parking is available in the School of Kinesiology Parking lot, which is to the west of the building, behind it. There is also street parking available on Earl Street (north of the building)."
  ],
  "map": "https://goo.gl/maps/5WBwHNMxTtPhK7z68"
}
