{"name": "Ban Righ Centre", "coords": [44.224745999999996, -76.49684623921416], "addr": "32 Bader Lane", "images": [{"src": "/images/buildings/ban-righ-centre-0.jpg", "alt": "[photo of Ban Righ Cntre]"}], "desc": ["Opened in 1974 as the Ban Righ Foundation for Continuing University Education, this centre for mature women students is the home for Ban Righ Foundation activities. It was made possible by 50 years of thrifty management of the women's residences by Alumnae Association volunteers.", "These volunteers won a role in the management of the campus's university-owned women's residences in the 1920s after planning and largely funding Ban Righ Hall (for more on their role before and after, see entries on Alumnae Association and Residences).", "At that time, they also insisted that any surplus that accumulated in the running of the women's residences be ploughed back into women's residences, and the Board of Trustees, doubtful that any such surplus would arise, agreed.", "By the early 1970s, when the central university offices took over the management of women's residences, a substantial surplus had accumulated. A committee of the Ban Righ (Women's Residences) Board, headed by Dr. Jean Royce, discussed the wisest use of these funds.", "The committee recognized the obstacles faced by women who had been out of the educational system for a time and who wished to enter or re-enter the University, and felt that with support and encouragement, many women could overcome these obstacles and fulfill their desire for further education. They envisaged the Foundation as a place of intellectual vitality by way of individual accomplishment and mutual encouragement.", "Through the Ban Righ Centre, the Foundation supports the personal development and academic achievements of women entering Queen's as mature students, or re-entering after a time away, and facilitates their involvement in university life.", "The Centre offers a non-credit program of speakers and workshops open to the public; provides a drop-in centre, study space, financial assistance, fax, photocopier, computers, and kitchen for student use; and provides both personal and academic support.", "The Ban Righ Centre is located at 32 Bader Lane in the former home of William Everett McNeill, an influential former Vice-Principal and Treasurer of the University (1930-1947), and his wife Caroline McNeill, Queen's first Dean of Women.", "Learn more about Ban Righ Centre..."], "location": "", "entrances": [], "corridors": "", "wayfinding": "", "washrooms": "", "fountains": "", "classrooms": "", "elevators": "", "services": "", "parking": "", "desc_src": "https://www.queensu.ca/encyclopedia/b/ban-righ-centre", "access": ["This building directory entry is under construction"], "map": "https://goo.gl/maps/VAhip6srangT6gta6"}