{"name": "Beamish-Munro Hall", "coords": ["44.2279618", "-76.4927495"], "addr": "45 Union St", "images": [{"src": "/images/buildings/beamish-munro-hall.jpg", "alt": "Street view of Beamish-Munro Hall."}], "desc": ["", "Beamish-Munro Hall, located at the corner of Union Street and Division Street, is named in honour of the families of Robert Beamish (Sci'60) and Donald Munro (Sci'52). It is the home of the Integrated Learning Centre and Faculty of Engineering and Applied Science.", "The building opened in May 2004, and in 2005 it was selected as one of the most environmentally advanced buildings in Canada. This recognition by the Sustainable Buildings '05 Canadian Team was part of the fourth International Green Building Challenge (GBC) 2005.", "Beamish-Munro Hall is a student-oriented building, designed in collaboration with students.", "In keeping with the integrated learning component for engineering students, this 'live building' serves as a resource to broaden awareness of green building design and environmental sustainability. The facility itself is instrumented as a working laboratory – where students can see structural elements of the building that are usually hidden and monitor systems like air quality, heating, lighting, and cooling using specially designed software – showing how sustainable practices can be incorporated into building design. It also boasts a design studio and a prototyping centre, group rooms, a multimedia facility, a site investigation facility, active learning centre and plazas or lab facilities.", "Learn more about Beamish-Munro Hall/Integrated Learning Centre..."], "desc_src": "https://www.queensu.ca/encyclopedia/b/beamish-munro-hall", "access": ["Location: Beamish-Munro Hall is located on Union Street near the corner of Division Street. It joins Dupuis Hall to the north and Goodwin Hall from the south. ", "Entrances", "South/West (Main and Accessible entrance):\nThe main entrance along Division Street is accessible with an automatic door opener.", "East: (listed under alternative entrances below)", "Alternative Entrances:\nEast Entrance near Walter Light Hall - The east entrance near Walter Light Hall's entrance is accessible with an automatic door opener.\nThrough Dupuis Hall - Dupuis Hall levels 0, 1 and 2 are accessible to Beamish-Munro Hall levels 1, 2 and 3. Only Dupuis Hall level 1 to Beamish-Munro level 2 has an automatic door opener.\nThrough Goodwin Hall - Goodwin Hall level 2 is accessible to Beamish-Munro Hall level 2 with an automatic door opener.", "Corridors: There are some doors that act as barriers in the corridors.", "Elevators: The elevator is located through the lobby on the left. It allows access to all floors in the building. The elevator measures 80” by 57” with a door of 42”. It is equipped with Braille buttons and an audible announcement system but not with mirrors.", "Ramps: There are ramps on the main level to access elevators.", "Wayfinding: The signage for this building is located on a sign located on the left-most corner of the north-facing side of the building beside a main-floor window.", "Washrooms: Accessible Multi-user Male and Female designated washrooms are available on each floor but are not equipped with power door openers.", "Services: There is an assistance phone on level 1 in the lobby and an emergency phone on level 2 and 3.", "Parking: Permit parking is available in the parking lot at the back of the building off Clergy Street, School of Kinesiology Parking lot, and in the ARC underground parking lot. There is an accessible pay parking spot on Union Street at the corner of Division Street in front of the School of Kinesiology Parking. ", "Water Fountain: There is an accessible water fountain on level 2, and a bottle fill station on the first floor in the lobby.", "Link to Beamish-Munro Hall on the Queen's Campus Map", "Link to Beamish-Munro Hall on Google Maps", "Link to Beamish-Munro Hall Floor Plans", "Link to Beamish-Munro Hall Site Plans"], "map": "https://goo.gl/maps/YW8hj6dkv44kzbmRA"}