{"name": "Biosciences Complex & Earl Hall", "coords": [44.226406, -76.4912300984252], "addr": "116 Barrie St", "images": [{"src": "/images/buildings/biosciences-complex-0.jpg", "alt": "[photo of BioSciences Complex]"}], "desc": ["", "Officially opened on November 28, 1997, the BioSciences Complex houses the Department of Biology, PARTEQ, and various other science and technology-oriented departments.", "The complex features a large atrium with student study space and art displays, large lecture halls used by many different departments, and the Queen's Phytotron, featuring a number of greenhouses.", "The $52 million BioSciences Complex is equipped with some of Canada's most sophisticated facilities for research in biotechnology and molecular science. Bringing together researchers from many different faculties and departments, the complex facilitates research collaboration and has strengthened the role of Queen's as a leader in scientific scholarship.", "The BioSciences Complex incorporates the old Biology Building, Earl Hall, which was built between 1963 and 1966. The Queenston limestone that encases Earl Hall can still be seen as part of the east wall of the BioSciences atrium."], "desc_src": "https://www.queensu.ca/encyclopedia/b/biosciences-complex", "access": [" ", "Location: Bioscience Complex is located just south of Union Street, and faces onto both Barrie and Arch Streets. It is north of the Cataraqui Building on Barrie Street, and Abramsky Hall on Arch Street.", "Entrances", "East\nThe Barrie Street entrance is accessible with a level approach to the door but has no automatic opener.", "West\nThe Arch Street entrance is accessible with a ramp and two sets of doors with automatic openers. The ramp has a railing. The opener for the first door is small and located on the left when entering the building. This entrance will bring visitors into the building's Atrium and cafeteria areas.", "Corridors: There are doors that act as barriers in the corridors. These doors do not have automatic openers or buttons.", "Elevators: There are three elevators. The two elevators at the southeast and northeast corners of the Complex are the easiest to access. They are both equipped with wide doors (48”) and low control buttons in Braille.\nAn older elevator is in the central Earl Hall portion of the building. It is a small elevator and may require wheelchair users to back in to it. Its entrance is 34”. Interior dimensions are 64” by 64”.", "Wayfinding: The signage for this building is on the right side of the wall perpendicular to the front entrance.", "Washrooms: There are several accessible washrooms on level 1. These washrooms do not have power doors. Single-user washrooms with power doors exist for staff and clients of the Department of Medicine research clinic but these doors are locked.\nLower level contains two single-user accessible washrooms with no power door. Level 2 contains accessible multi-user and single-user washrooms designated male and female. The single use washrooms do not have accessible signage but are accessibility equipped. Level 3 is the same. Level 4 is the same as level 2 and 3 but lacks single-user washrooms.\nBaby change tables are in the men’s washroom only in the hallway closest to the main auditorium (Room 1101).\nSingle user washrooms: Floor 0 – Rooms 594 & 591, Floor 1 – Rooms 1603 & 1625, Floor 2 – Rooms 2289 & 2288, Floor 3 – Rooms 3288 & 3289.", "Services: Colour floor plans showing the locations of elevators, washrooms and more are in a number of spots throughout the building including the vestibules at the Arch and Barrie Street Entrances. There is a Tim Hortons, a Tim Hortons express, and a bank machine on level 1.", "Classrooms: Check the classroom website for the accessibility of Biosciences Complex classrooms.", "Parking: Permit parking is available in the parking lot behind Humphrey Hall. There is pay parking on Arch Street, Barrie Street, and one accessible meter space on Stuart Street at George Street.", "Water Fountain: There is an accessible water fountain and bottle fill station on level 1, by Room 1502 and the second floor by Room 2393.", "Link to Biosciences Complex on the Queen's Campus Map", "Link to Biosciences Complex on Google Maps", "Biosciences Complex Floor Plans", "Biosciences Complex Site Plans"], "map": "https://goo.gl/maps/qq9nWLD4UGGK8CDGA"}