{"name": "Cancer Research Institute", "coords": [44.2242737, -76.4928484], "addr": "10 Stuart Street", "images": ["./public/images/buildings/cancer-research-institute-0.jpg"], "alts": ["[photo of the Cancer Research Institute]"], "desc": ["This Institute was formally established by the Board of Trustees in June 2001. Its goal is to create an environment that represents the full spectrum of cancer research and to provide opportunities for collaborative research and multidisciplinary training.", " ", "The Institute has three divisions: Cancer Biology and Genetics, which includes the Cancer Research Laboratories plus investigators with a primary focus on Cancer Genetics; Cancer Clinical Trials, which includes the Canadian Cancer Trials Group or CCTG (formerly NCIC Clinical Trials Group); and Cancer Care and Epidemiology, which includes the Radiation Oncology Research Unit plus investigators with a primary interest in environmental causes of cancer.", "The three divisions are supported by a large number of faculty, graduate and post-doctoral trainees and support staff.", "Lean more about the Cancer Research Institute..."], "desc_src": "https://www.queensu.ca/encyclopedia/c/cancer-research-institute", "access": ["Location: The Cancer Research Institute is located off Stuart Street attached to Botterell Hall.", "Entrances", "North\nThe main entrance is accessible with power door.   ", "Corridors: There are doors that act as barriers in corridors.", "Elevators: Interior accessible route to elevator allows access to all floors in the building.", "Washrooms: There are designated accessible washrooms available on each floor, but without power doors. Single-user washrooms: floor 1 room 195, floor 2 room 295, floor 3 room 395.", "Parking: Permit parking is available in the parking lot on the south side of this building. There is one accessible meter space on Stuart Street in front of Botterell Hall.", "Link to Cancer Research Institute on the Queen's Campus Map", "Link to Cancer Research Institute on Google Maps", "Cancer Research Institute Floor Plans", "Cancer Research Institute Site Plans"], "map": "https://goo.gl/maps/w6D1eD6gPTYrFdLq9"}