{"name": "Carruthers Hall", "coords": [44.2263175, -76.49369722058823], "addr": "62 Fifth Field", "images": [{"src": "/images/buildings/carruthers-hall-0.jpg", "alt": "[photo of Carruthers Hall]"}], "desc": ["Built in 1890, Carruthers Hall is one of the oldest buildings on campus: only Summerhill, Theological Hall, and the Old Medical Building are older.", "It was the first building at Queen's built for strictly scientific purposes and the money for it was raised as part of the famous Jubilee Campaign, with more than half of it contributed by John Carruthers, a Kingston businessman who helped Principal Grant in his efforts to convince the Board of Trustees to ask the government to establish the School of Mining and Agriculture.", "The building was designed by Professors Nathan Fellowes Dupuis and William Lawton Goodwin after they spent some time visiting American universities for inspiration. Due to budget constraints, when the building opened in 1891 as the new science hall, it wasn't fully furnished.", "In 1893, Carruthers Hall was occupied by the Ontario School of Mining and Agriculture, which later became the Faculty of Engineering and Applied Science.", "Carruthers Hall was the first building in Kingston to be fitted with electric lighting, which was installed by Professor Goodwin. The hall was officially opened by Chancellor Sir Sandford Fleming on October 16, 1891.", "It now holds the CFRC Radio Station, the Gordon Vogt Studio Theatre, the Department of Public Health Sciences, and a variety of offices."], "desc_src": "https://www.queensu.ca/encyclopedia/c/carruthers-hall", "access": ["Location: Carruthers Hall is located east of Fleming Hall (Jemmett Wing).", "Entrances", "North/South\nCarruthers Hall is not accessible from the north or south entrances.", "East\nThe east entrance to the Radio Station is accessible through a mobile climber. ", "West\nThe west entrance is accessible.", "Corridors: There are doors that act as barriers in corridors.", "Elevators: There is an elevator on the west side of the building, which acts as the accessible entrance to the first floor. It is 38” wide and 58” long. The opening is 42”. Buttons are not in Braille, there is no audible system, nor is the elevator mirrored.\nA second elevator inside the building is for internal circulation only. It is 38” wide and 57” long. The door to the elevator measures at 36”. Buttons are not in Braille, there is no audible system, nor is the elevator mirrored.", "Wayfinding: The signage for this building is to the left side of the east entrance.", "Washrooms: There are single-user accessible washrooms in the basement and third floor. Female and Male designated accessible washrooms are on level 1. None of the washrooms have automatic door openers. All gender washrooms: floor 0 rooms 10 & 11, floor 2 room 201, floor 3 room 305.", "Parking: Permit parking is available on 5th Field Company lane behind Kingston/Theological Halls and in the parking lots behind Jackson Hall and Kingston Hall. There is one accessible pay parking on North side of Union Street across from Fifth Field Company Lane.", "Water Fountain: There is an accessible water fountain with bottle fill station on level 1 in front of Room 103.", "Link to Carruthers Hall on the Queen's Campus Map", "Link to Carruthers Hall on Google Maps", "Carruthers Hall Floor Plans", "Carruthers Hall Site Plans"], "map": "https://goo.gl/maps/TCYi3j3AjRBKgVhU9"}