{"name": "Chernoff Hall & Auditorium", "coords": [44.2242516, -76.49886526622575], "addr": "90 Bader Lane", "images": [{"src": "/images/buildings/chernoff-hall-0.jpg", "alt": "[photo of Chernoff Hall]"}, {"src": "/images/buildings/chernoff-hall-1.jpg", "alt": "[photo of Chernoff Hall Auditorium]"}], "desc": ["Established through the efforts of the Chernoff family, this $59 million, state of the art facility has been home to the Department of Chemistry since its completion in the Fall of 2002.", "Located on Bader Lane across from Victoria Hall (on the site of the former St.Lawrence Building, which was torn down to make room for the new construction), this five-floor structure houses both \"wet\" sections (laboratory-based) and \"dry\" sections (administrative-based). Of its more than 14,000 square metres of space, more than 5,000m² is devoted to lab space.", "The project was accomplished through the \"Campaign For Queen's\" with the support of the Ontario Government SuperBuild program, the Ontario Innovation Trust, and the Canada Foundation for Innovation, as well as from private donations, most notably from the Chernoff family.", "The architects were Brisbin Brook Beynon Architects (lead architectural/engineering firm) and Sauvé Boucher Associates (structural engineering), both from Ottawa, Ontario; Crossey Engineering (electrical engineering), North York, Ontario; and Keen Engineering (mechanical engineering), Toronto, Ontario."], "location": "Chernoff Hall is located on the south side of Bader Lane between Watts Hall to the east, and west of Stirling Hall. Chernoff Auditorium is located directly in between Chernoff Hall and Stirling Hall.", "entrances": ["North\nThe main entrance (North) door and vestibule door are accessible with an automatic door opener. The entrance door to Chernoff Auditorium from Bader Lane is accessible with an automatic door opener.", "South\nThe South entrance door and vestibule door on Stuart Street are both accessible with an automatic door opener.", "Elevators: Three There are two elevators in Chernoff Hall. The North elevator serves all building levels and is located in the corridor (to the right-hand side from the north entrance) off the atrium. The North elevator has a 42” wide doorway and an internal elevator cab size of 58” deep x 80” wide. There is Braille on the elevator keypad inside the elevator. The elevator is not mirrored. The South elevator serves all building levels (but levels 3, 4 and 5 require Card Access) and is located to the left of the south street entrance off of Stuart Street. The South elevator has a 36” wide doorway and an internal elevator cab size of 51.5” deep x 68.5” wide. There is Braille on the elevator keypad inside the elevator. The elevator is not mirrored.", "Washrooms: There are accessible Male and Female designated Multi-user washrooms on all building floors, but without automatic door openers. All washrooms are located near the North elevator. Accessible Male and Female designated Multi-user washrooms are also available in the auditorium lobby (to the left of the entrance area). There are no Single-user, accessible washrooms in this building.", "Services: There is an accessible pay telephone just right of the North Entrance on level 2. There are sit-down computer stations that are accessible to some on level 1, by room 160."], "corridors": "There are doors in corridors that act as barriers. There are restricted areas that require either card access or permission, but none have automatic door openers. There is a ramp to the lower level of the Auditorium entrance, but there are no handrails, the slope is steep, and the door does not have automatic door openers.", "wayfinding": "The signage for these buildings are located outside the front entrances.", "washrooms": "", "fountains": "There are accessible water fountains on each floor. Levels 1 and 2 are located at the entry area to the washrooms near the north elevator (level 2 also has an accessible water bottle fill station). Levels 3, 4 and 5 are located near the north elevator (level 5 also has an accessible water bottle fill station).", "classrooms": "There are centrally booked classrooms in the building. Check the classroom website for the accessibility of Chernoff Hall's and Chernoff Auditoriums classrooms.", "elevators": "", "services": "", "parking": "Permit parking is available on Bader Lane and Albert Street. Time limited parking spaces are on Stuart Street and St. Lawrence Avenue.", "desc_src": "https://www.queensu.ca/encyclopedia/c/chernoff-hall", "access": [" "], "map": "https://www.queensu.ca/campusmap/main?mapquery=chernoffaudi"}