{"name": "Craine Building", "coords": ["44.22726075", "-76.49198455"], "addr": "56 Arch Street", "images": [{"src": "/images/buildings/craine-building.jpg", "alt": "Street view of Craine Building."}], "desc": ["", "Completed in 1938, the Craine Building adjoins Humphrey Hall on the north side and was the first of many at Queen's to be constructed with a facing of buff-coloured Queenston limestone instead of the usual grey Kingston limestone.", "It was the only major construction effort undertaken by Queen's during the Depression and was made possible by a gift from Agnes Douglas Craine, who graduated in 1888 from the Queen's-affiliated women's medical college.", "Agnes named the building in honour of her parents, John Joseph and Agnes Muir Craine, and her brother John Craine.", "She endowed the building specifically for teaching and research in biochemistry; it was used for that purpose until the 1970s."], "desc_src": "https://www.queensu.ca/encyclopedia/c/craine-building", "access": ["Location: The Craine Building is located on Arch Street, South of Humphrey Hall (the two buildings are joined), and across the street from the Biosciences Complex.", "Entrances", "East\nThe Craine Building has no accessible exterior entrances and no exterior access to the building without prior authorization. Access to this building is from Humphrey Hall whose main entrance is off Arch Street. The Humphrey Hall entrance is accessible with a power door.", "Alternative Entrance (through Humphrey Hall)\nLevel 2 and 3 are accessed using Humphrey Hall's elevator. Turn right when exiting the elevator, then right again at the main hallway. The door connecting to the Craine Building is at the end of the hall. It does not have an automatic opener.", "Elevators: Humphrey Hall's elevator is located in a small corridor halfway down the hallway off the Humphrey's main lobby. The elevator provides access to all levels of both Humphrey Hall and the Craine Building. The elevator is not mirrored, there is no Braille or audible announcement system.", "Wayfinding: The signage for the Craine Building is located to the left side of the front entrance.", "Washrooms: An accessible Single-user washroom is located on level 1 (124) and level 3 (323) of Craine without power door. There are also accessible washrooms near the elevator on level 1 of Humphrey with power door.", "Parking: Permit Parking is available in the parking lot behind Humphrey Hall. There is one accessible metered parking spot on Stuart Street at George Street and one on Union Street at Division Street", " ", "Link to Craine Building on the Queen's Campus Map", "Link to Craine Building on Google Maps", "Craine Building Floor Plans", "Craine Building Site Plans"], "map": "https://goo.gl/maps/dG1NU5UTmynvM2VE6"}