{"name": "Donald Gordon Centre", "coords": ["44.2246394", "-76.50989"], "addr": "421 Union Street", "images": [{"src": "/images/buildings/donald-gordon-conference-centre.jpg", "alt": "Street view of Donald Gordon Centre."}], "desc": ["Donald Gordon Conference Centre. Courtesy: George Lilley", "Originally opened in 1974, the Donald Gordon Conference Centre is a state of the art conference and hospitality facility that is wholly owned and operated by Queen's University. It is used both by Queen's groups and others and is the home of the Queen's Executive Development Centre.", "The core of the Centre is Roselawn House, an elegant limestone country house built in 1841 by noted Kingston architect William Coverdale for David John Smith, a local lawyer. Ironically, Smith had bought the site, located on Union Street at College Street, from Queen's: it was part of the young college's original 50-acre land holding.", "By the time Queen's bought back the property in 1970, the house had served as a private home for more than 100 years and, between 1948 and 1969, as the official residence of the Commandant of the National Defence College.", "A large modern addition containing accommodation, dining rooms, and meeting rooms was added by Queen's before opening in 1974 as the Donald Gordon Centre for Continuing Education. In 1989, the university contracted out the management of the centre and conference services to a private management company. In 1997, the Centre re-opened after being closed for one year for renovations, including the introduction of state of the art technology and improved levels of comfort, convenience, and service. It is used both by Queen's groups and others and attracts national and international conferences every year.", "The centre is named after Donald Gordon (1901-1969), a banker, financier, public servant, member of the Board of Trustees, and generous benefactor to the University.", "Learn more about the Donald Gordon Conference Centre..."], "desc_src": "https://www.queensu.ca/encyclopedia/d/donald-gordon-conference-centre", "access": [" ", "This building directory entry is under construction.", " ", "Link to Donald Gordon Centre on the Queen's Campus Map", "Link to Donald Gordon Centre on Google Maps", "Donald Gordon Centre Floor Plans - N/A", "Donald Gordon Centre Site Plans - N/A"], "map": "https://goo.gl/maps/hjErMQLJho3zDhYx5"}