{"name": "Douglas Library", "coords": ["44.2274612", "-76.4950461"], "addr": "93 University Avenue", "images": [{"src": "/images/buildings/douglas-library.jpg", "alt": "Street view of Douglas Library."}], "desc": ["", "This campus landmark is the oldest of Queen's libraries. The southern half of the building was completed in 1923-4 and is faced with Kingston limestone; the northern part, built in the same neo-gothic style but faced with Queenston limestone, was added in 1966 and features three underground floors.", "The library's functions have evolved considerably over its 70-year history. It was originally built to house the university's whole library collection and also contained the offices of the Principal and other senior officials until Richardson Hall was built in 1954.", "When separate faculty and departmental libraries began to multiply across campus in the 1960s and 70s, Douglas Library became the university's main social sciences and humanities library, as well as the home for the library system administrative offices, a periodicals room, and a Special Collections unit for rare or fragile publications.", "After the opening of Stauffer Library in 1994, Douglas Library was closed for extensive renovation to improve space and mechanical services. It reopened in 1997 as an amalgamated library replacing individual department libraries for the Faculty of Engineering and Applied Science and several science departments within the Faculty of Arts and Science, and was renamed the Engineering and Science Library.", "Courtesy Wallace R. Berry", "In a second phase of renovations to one floor of the Douglas Library, the W.D. Jordan Special Collections and Music Library was created and opened in 1999. At the same time, a refurbishment of the two reading rooms located on the top floor (which contain beautiful stained glass windows) was undertaken.", "The Library is located on the southeast corner of University Avenue and Union Street, and is named in honour of James Douglas, Queen's Chancellor from 1915 to 1918.", "There is a story told among students that Douglas Library was built backwards, and the side that faces away from University Avenue is actually supposed to face the street. This legend probably started because the east library entrance (the \"back\") is by far the grander of the two entrances. However, the truth is that there used to be a large open park space on the east side of Douglas Library and this grand entrance was designed to be visible from this area, which was a common gathering place of students. For more in this campus legend, see \"Douglas yarn unravels\" below...", "Learn more about Douglas Library...", "See also: W.D. Jordan Rare Books & Special Collections", "This article originally appeared in  The Queen's Journal  on September 14, 2010.", "By Jake Edmiston, Assistant Sports Editor", "Students use tennis courts behind Douglas Library circa 1925. Photo courtesy Queen's Archives.", "A campus legend is losing its legs. Last week, Ron Lau told the first-year students in his frosh group exactly what his Gael told him the year before.", "\"We told them it was rumoured that Douglas Library was built backwards,\" said the Arts Sci '13 Frosh Week leader.", "But unlike most incoming first-year students from previous years, frosh who attended the newly implemented Inter-faculty Day last Thursday were told the popular tale is a falsity. During a scavenger hunt, Lau's frosh were given a clue leading them to Douglas Library. The clue explained the rumour, then dispelled it.", "The legend usually tells of an eccentric European architect who's [sic] life's work was designing Douglas Library. When the building was constructed backwards, the architect subsequently killed himself.", "Blueprints from the Queen's Archives tell a less entertaining tale. Several folders filled with original blueprints and floor plans dated as early as 1916 suggest that the more elaborate side of the building was positioned to face away from University Avenue on purpose.", "Every plan in the Queen's Archives labels the University Ave. side of the building the \"west\" entrance. What is now considered the back entrance was labelled the \"east\" entrance. Neither side is stipulated as the main entrance.", "Local architectural historian Jennifer McKendry completed a survey depicting how campus looked in 1921. She said University Ave. acted as the western border of the campus. The opposite side of University Ave., now occupied by buildings like Dunning and Richardson halls, was lined primarily with houses during the time of Douglas' construction.", "\"There are many (ideas) about architecture that I've investigated that have no validity,\" said McKendry. \"On the east side, there was already an established campus.\"", "Tennis courts and a courtyard were positioned directly in front of the eastern entrance of Douglas Hall.", "Douglas Library facing University Ave. circa 1930.", "Photo courtesy Queen's Archives.", "The eastern entrance is outfitted more lavishly and includes a large, square tower because it would have been the most frequented entrance at the time.", "\"One has to put oneself back and imagine the physical setting of campus in the 1920s,\" McKendry said. \"There were many pathways to recreational and social events in that inner block (behind Douglas).\"", "Construction on the $350,000 library began in 1923 after a sizable donation from the building's namesake, Chancellor James Douglas. The Ontario provincial government also partially funded the building, which was completed in 1924. Toronto architects Delano Dexter Calvin and Richard K. Shepard developed the plans for Douglas in 1916. McKendry said the implementation of Shepard and Calvin's plans were delayed eight years because of World War I.", "According to The Biographical Dictionary of Architects in Canada, Calvin was born in 1881 on Garden Island near Kingston. He graduated from Queen's in 1902 and moved to Paris to study architecture. After returning to Canada, Calvin met Shepard in Toronto and they formed a partnership in June 1913. An Aug. 23, 1933 obituary for Shepard in Toronto's Empire and Mail claimed he died of 'a brief illness.' Calvin died in 1948, over two decades after Douglas was completed.", "A prominent New York architect, E.L Tilton, is listed as a consultant. Tilton was born in 1861 and died in 1933, the same year as Shepard.", "Stewart Fyfe, an Arts'49 alumnus and former Kingston city planner, said the hub of campus was located to the east of Douglas even when he was a student over 20 years after the building was erected.", "\"There was nothing on the west side of University except the original Ban Righ building,\" Fyfe said, adding that the centre of campus didn't begin to shift west until the construction of buildings like Richardson Hall in the 1950s.", "Later on, a $2 million addition was added to Douglas in 1965 to switch \"the orientation west to University Ave.\" according to a Queen's Heritage Study.", "Robert Hill, editor of the Biographical Dictionary of Architects said that the rumor might have been a popular one but not a plausible one.", "\"As an architect I can tell you that there is extensive and time-consuming planning which goes into the siting and orientation of a building,\" he said via e-mail. \"The notion that a large building like the Douglas Library could be have been 'constructed backwards' is, quite frankly, improbable.\"", "Reproduced with the permission of The Journal."], "desc_src": "https://www.queensu.ca/encyclopedia/d/douglas-library", "access": ["Location: Douglas Library is located on University Avenue at Union Street North of Ontario Hall.", "Entrances", "West\nThe main entrance of Douglas Library is accessible with automatic door openers. The building entrance is on the ground floor which is designated \"level 4\".", "Corridors: There are some non-powered doors and narrow areas due to shelving.", "Elevators: There are three elevators in the building. Two elevators are for public use and the third elevator is used by library staff and allows access to restricted areas on the third and fourth level. The elevators on the ground floor are located just past the information desk. There is no elevator to the north mezzanine reading area archives.", "Wayfinding: The signage for Douglas Library is located on a freestanding sign on the lawn to the right front side of the building.", "Washrooms: Accessible Single-user Male and Female washrooms with power door are on level 4 behind the elevator. Accessible Single-user and Multi-user Male and Female washrooms with no power door are on levels 3, 5, 6, and 7. All gender washrooms: 490, 491, 689", "Services: Library Staff are available to assist users. The front desk is available immediate in front of the main doors. More information can be found on the library’s accessibility page.", "Parking: Permit parking is available in the Miller Hall parking lot East of Douglas Library and the Mackintosh-Corry parking lot West of University Avenue. There is one accessible meter space on Union Street across from Miller Hall.", "Water Fountain: Accessible water fountains with bottle fill stations are located on the first floor behind the elevators.", " ", "Link to Douglas Library on the Queen's Campus Map", "Link to Douglas Library on Google Maps", "Douglas Library Floor Plans", "Douglas Library Site Plans"], "map": "https://goo.gl/maps/gJebcSE9amFhGedS7"}