{"name": "Duncan McArthur Hall", "coords": ["44.2239374", "-76.5148295"], "addr": "511 Union Street", "images": [{"src": "/images/buildings/duncan-mcarthur-hall.jpg", "alt": "Street view of Duncan McArthur Hall."}], "desc": ["", "Duncan McArthur Hall is one of the few buildings located on the west campus of Queen's University. The campus is located about two kilometres west of the main campus and was purchased by Queen's in 1969. Before Queen's bought the 61-acre area, it held a farm and a stone quarry, both of which were worked by inmates of the Kingston Penitentiary.", "Duncan McArthur Hall, built between 1969 and 1971 with funding from the Ontario government, is a very large building which houses Queen's Faculty of Education, made up of administrative offices, classrooms, labs, technical shops, and the large Education Library.", "It is named after a former professor of history at Queen's, Duncan McArthur, who served as the provincial Minister of Education in the 1940s. The entire faculty is sometimes known as McArthur College, which was, in fact, its official name until 1971."], "desc_src": "https://www.queensu.ca/encyclopedia/d/duncan-mcarthur-hall", "access": [" ", "Entrances", "North\nThe B Wing to the North is accessible. Entrances are accessible after 4:30 p.m. only to students with card access. A Wing entrance is not accessible.", "South\nThe main entrance is accessible by a ramp with handrails at the east side of the parking lot.", "Link to Jean Royce Hall\nThe main floor link to Jean Royce Hall is accessible to students with card access after 4:30 p.m.", "Corridors: There are corridor doors that act as barriers", "Elevators: There are two elevators in Duncan McArthur but B-Wing elevator is non-compliant with accessibility standards. There is also a lift on the second floor for access to B304 and 3rd level of the library, however it cannot be independently operated. There is another lift for level difference between B242 and B245.", "Washrooms: There are designated accessible single-user washrooms available on the basement, First, and Second floors with power door.  There are Male and Female Multi-User accessible washrooms with no power door on the First and Second floors. Single user washrooms: A117A, A030F, A202C, A307B, B161, B162 (staff only), B245E.", "Services: The Education Library is accessible with power doors. Staff at the library information desk are available to assist users. Assistance phones are located in the building on the main floor.", "Classrooms: Check the classroom website for the accessibility of Duncan McArthur Hall classrooms.", "Parking: Permit parking is available at the front and rear of the building. Visitor parking is located at the front of the building.", "Water Fountain: Water fountains are located by the gymnasium.", " ", "Link to Duncan McArthur Hall on the Queen's Campus Map", "Link to Duncan McArthur Hall on Google Maps", "Duncan McArthur Hall Floor Plans", "Site Plans - N/A"], "map": "https://goo.gl/maps/Fz54Rjcp1VvvAPyj6"}