{"name": "Dunning Hall", "coords": [44.2275027, -76.49603012409865], "addr": "94 University Avenue", "images": [{"src": "/images/buildings/dunning-hall-0.jpg", "alt": "[photo of Dunning Hall in 1988]"}], "desc": ["Dunning Hall, 1988. Courtesy Currah.", "Dunning Hall was built in 1960 and is faced with Queenston limestone. It originally housed the departments of Economics, Political Science, Geography, and Sociology, as well as the School of Industrial Relations and the School of Commerce.", "As each of these departments expanded and new buildings were erected, most of these departments moved out and the purpose of Dunning Hall became more specialized.", "It housed the School of Business for many years, but on the completion of Goodes Hall in the fall of 2002, it became the home of the Department of Economics.", "Located at the southwest corner of University Avenue and Union Street, it includes the spacious Dunning Auditorium, used for public lectures and large classes.", "When Mackintosh-Corry Hall was completed in 1973, a walkway was built which connects it with Dunning Hall. Dunning Hall also connects with the Law Building through an underground passageway.", "Dunning Hall is named in honour of politician and former Chancellor of Queen's, Charles Avery Dunning."], "location": "", "entrances": ["North\nThe north door has an automatic opener.", "South/West\nThe southwest entrance of Dunning Hall is accessible with automatic door opener and is located under the Mackintosh Corry link. A ramp, with railings on both sides, leads to the lowest level of the building. The ramp has a sharp left turn near the top and a long slope down to the next automatic door.", "East\nThe Dunning Auditorium has a level entrance off University Avenue. The auditorium is linked to the upper floors of the building. To access the lower levels, use the southwest (rear) building entrance. There is a lift next to the auditorium steps."], "corridors": "There are doors that act as barriers in corridors. There is a wheelchair lift across from the main entrance that goes down to the basement level", "wayfinding": "The signage for this building it located to the left side of the entrances.", "washrooms": "Basement washrooms are accessible with no power door. There is one Single-user accessible washroom with power door on the first floor across from the elevator.  On the second floor, there are Female and Male Multi-user accessible washrooms with no power door. On the third floor only the Male Multi-user washroom is accessible with a power door. ", "fountains": "There is an accessible water fountain with a bottle fill station in the lower level by Room 149 and another on the lowest level near Room 014.", "classrooms": "Check the classroom website for the accessibility of Dunning Hall classrooms.", "elevators": "The elevator, located in Dunning Hall's main hallway, provides access to all levels of the building except the auditorium. It measures 81” by 57” with an opening of 42”. It is equipped with Braille buttons, but not with an audible announcement system or mirrors.", "services": "There is an assistance phone by the Auditorium.", "parking": "There is permit parking available at the Union Street parking garage (entrance off Union Street) and surface lot (entrance off of Albert Street). There is a ramp from the parking garage located between Mackintosh-Corry Hall and Robert Sutherland Hall, which leads through Richardson courtyard to rear of Dunning Hall and then to University Avenue.There are three accessible meter spaces on Alfred Street at Union Street and one accessible meter in across from Miller Hall on Union Street.", "desc_src": "https://www.queensu.ca/encyclopedia/d/dunning-hall", "access": [" ", "Alternative Entrance\nDunning Hall is also accessible from Mackintosh Corry Hall by taking the elevator located at the corner of B and F wings to the 3rd floor. When you exit the elevator turn right (north) to B3 and proceed to A3. Follow the directional signs to Dunning Hall. The ramp linking the buildings has a handrail. There is a door with an automatic opener leading to Dunning Hall level 1.", " "], "map": "https://goo.gl/maps/NM5h9rfWit2tU5u8A"}