{"name": "Dupuis Hall", "coords": [44.2285629, -76.49267198210384], "addr": "19 Division St", "images": [{"src": "/images/buildings/dupuis-hall-0.jpg", "alt": "[photo of Dupuis Hall in 1969]"}], "desc": ["Dupuis Hall, 1969. Courtesy Wallace R. Berry.", "Completed in 1966 and located on Division Street, Dupuis Hall is named after Nathan Fellowes Dupuis, an influential professor of mathematics at Queen's in the late 19th and early 20th centuries, and a founder of the Faculty of Engineering and Applied Science.", "The concrete of the exterior is broken up by small sections of decorative limestone facing in an attempt to appease the more traditionally-minded people on campus who objected to a building being erected at Queen's without the usual limestone."], "location": "Dupuis Hall is located on Division Street near the corner of Union Street.", "entrances": ["North (accessible)\nThe accessible entrance is located on Clergy Street near Division Street. A ramp leads to an entrance with an automatic door opener.", "West (main)\nThe main entrance to Dupuis hall is not accessible, there are stairs leading up to the entranceway."], "corridors": "There are doors that act as barriers in the corridors. These doors are not operator button installed. There is a ramp on level 2 by the main stairs. ", "wayfinding": "", "washrooms": "Accessible washrooms are available in the main floor by the auditoriums. They are gendered multi-user washrooms equipped with power doors. Single-user: B30, G55, G56, 385, 402. There is one single-user non-accessible washroom available in the basement to the left of the elevators and another on the third floor across from the elevators.", "fountains": "There is an accessible water fountain with bottle fill station on level 2, by the lecture theatre and in the basement beside room B15.", "classrooms": "Check the classroom website for the accessibility of Dupuis Hall classrooms.", "elevators": "The elevator is located at the back of the main lobby which is south of the accessible building entrance. The elevator provides access to all floors. It measures 79” by 61”, with an entrance of 54”. The elevator is not equipped with Braille buttons, an audible announcement system or mirrors.", "services": "There is an assistance phone on level 1 and an emergency phone on level 2. Both are by the main stairs.", "parking": "Permit parking is available in the parking lot behind Dupuis Hall. There is one accessible meter spaces on Union Street at Division Street.", "desc_src": "https://www.queensu.ca/encyclopedia/d/dupuis-hall", "access": [" ", "Alternative Entrance\nBeamish-Munro Hall level 2 can be accessed from Dupuis Hall level 1. The door has an automatic door opener.", " "], "map": "https://goo.gl/maps/TQ9QncrJvECLDkQP6"}