{"name": "Ellis Hall", "coords": ["44.2263495", "-76.49623623676982"], "addr": "58 University Avenue", "images": [{"src": "/images/buildings/ellis-hall.jpg", "alt": "Street view of Ellis Hall."}], "desc": ["", "Completed in 1958, this building has long been the home of the Department of Civil Engineering and of the Queen's Observatory, which is located on the roof.", "It is named after Douglas Stewart Ellis (1885-1955), a Queen's graduate who taught Civil Engineering between 1910 and 1955 and was Dean of Applied Science from 1943 to 1955.", "Ellis Hall was constructed to help alleviate the extreme pressure on the Faculty of Engineering which was the result of a huge increase in the demand for scientific courses at Queen's after the war.", "When Ellis Hall was under construction, some people felt that all the engineering buildings should be clustered together in the northeast end of campus. However, construction continued and Ellis Hall was built on University Avenue opposite Ontario Hall."], "desc_src": "https://www.queensu.ca/encyclopedia/e/ellis-hall", "access": [" ", "Location: Ellis Hall is located on University Avenue between Richardson Hall and Jeffery Hall.", "Entrances", "East\nThe main entrance to Ellis Hall is accessible. The concrete ramp from University Avenue to the front door has railings of both sides and one turn. There is an automatic door opener.", "Corridors: There are doors that act as barriers in the corridors in the basement. They are not equipped with operator buttons.", "Elevators: The elevator is in the lobby just beyond the stairs. The elevator has buttons in Braille, and an audible announcement system. It is not mirrored.", "Wayfinding: The signage for Ellis Hall is located on the left side, on a stone ledge beside the staircase, quite far out from the entrance.", "Washrooms: On the first floor, there is a Single-user accessible washroom with no power door (room 137). In the basement, there is a Male Multi-user accessible washroom with power door and a Single-user accessible washroom/shower with power door (room 39).", "Services: There is a directional site map in the entry area indicating the floor layout. An emergency phone can be found in the basement.", "Classrooms: Check the classroom website for the accessibility of Ellis Hall classrooms.", "Parking: Permit parking available at the underground parking garage on Union Street west of the building and the surface lot on Albert Street. There is a ramp from the parking lot, located between Mackintosh-Corry Hall and Robert Sutherland Hall which leads through Richardson courtyard to University Avenue. There are 3 accessible meter spaces on Alfred Street at Union Street and one accessible metered parking spot on Union Street across from Miller Hall.", "Water Fountain: There is an accessible water fountain with bottle fill station in the basement by the elevator.", " ", "Link to Ellis Hall on the Queen's Campus Map", "Link to Ellis Hall on Google Maps", "Ellis Hall Floor Plans", "Ellis Hall Site Plans"], "map": "https://goo.gl/maps/Z8KZEDjkK3myh8YT6"}