{
  "name": "Etherington Hall",
  "coords": [44.2242609, -76.4940028],
  "addr": "94 Stuart Street",
  "images": ["./public/images/buildings/etherington-hall-0.jpg"],
  "alts": ["[photo of Etherington Hall]"],
  "desc": [
    "",
    "Built in 1959, Etherington Hall houses the Departments of Medicine, Ophthalmology, Obstetrics and Gynaecology, and the Medical Art and Photography Service.",
    "It is named after Frederick Etherington, a former Dean of Medicine and the husband of Agnes Etherington, who bequeathed the Agnes Etherington Art Centre building, their family home, to Queen's."
  ],
  "desc_src": "https://www.queensu.ca/encyclopedia/e/etherington-hall",
  "access": [
    "Location: Etherington Hall is located on Stuart Street between Kingston General Hospital and Richardson Laboratory.",
    "Entrances",
    "North\nThe main entrance to Etherington Hall is not accessible.",
    "Alternative Entrances\nFrom Stuart Street: To access Etherington Hall from Stuart Street, use the main entrance to Richardson Laboratory. Enter Richardson Laboratory and take the elevator down one level and then follow the hall to the left, through the door to the ramp and to the corridor to Etherington Hall. The main door to Richardson Laboratory has an automatic opener.\nFrom the Underground Parking Garage: The Underground Parking Garage accesses the lower level of Etherington Hall by a tunnel under Stuart Street.\nFrom Kingston General Hospital (KGH): Etherington Hall's lower level can be accessed from KGH's Douglas Wing by going through Richardson Laboratory link.",
    "Corridors: There are doors that act as barriers in the corridors. These doors do not have operator buttons.",
    "Elevators: The elevator is located near the auditorium on the lowest level of Etherington Hall. The elevator accesses all floors in the building. It is 74” wide and 94” long. The door opening is 44”. The elevator does not have an audible system nor is it mirrored.",
    "Washrooms: Accessible washrooms are located on the lowest level near the auditorium and on level 1. Single user washrooms: 1002, 1003, 2002, 2003, 2008, 2018, 2026, 2052, 3014, 3017, 3027, 3045",
    "Classrooms: Check the classroom website for the accessibility of Etherington Hall classrooms.",
    "Parking: Permit parking is available in the lot behind McLaughlin Hall. There are two accessible meter spaces across the street from Etherington Hall. The Underground Parking Garage on Stuart Street at University Avenue offers permit and hourly parking and is accessible from Etherington Hall by a tunnel under Stuart Street."
  ],
  "map": "https://goo.gl/maps/CwbM8kVJ8yT6xpUf6"
}
