{"name": "Flemming Hall: Jemmet Wing", "coords": [44.2264515, -76.4942809], "addr": "78 Fifth Field (south side)", "images": [{"src": "/images/buildings/fleming-hall-0.jpg", "alt": "[photo of Fleming Hall, Jemmett Wing]"}, {"src": "/images/buildings/fleming-hall-1.jpg", "alt": "[photo of Fleming Hall, Stewart-Pollock Wing]"}], "desc": [" ", "Fleming Hall is today a building comprised of two wings: Jemmett and Stewart-Pollock. The Jemmett Wing, the southernmost of the two wings, is the original Fleming Hall, which was built between 1902-1904. The Stewart-Pollock wing, added in 1964, sits north of the original building and is attached by a second floor walkway. The building of the original Fleming Hall was the result of Principal George Monro Grant's attempts to secure a number of new buildings for Queen's before his death.", "Fleming Hall was funded by a $112,500 gift from the Ontario government to the Kingston School of Mining and Agriculture. Principal Grant had created this \"independent\" school, affiliated with Queen's, in order to sidestep the government regulations against giving funding to a denominational university (which Queen's was at the time). The School of Mining was, in reality, an arm of the Queen's Faculty of Practical Science, which had been established in 1894. Thus the gift to this \"independent\" school resulted in two new buildings for Queen's - and one of them was Fleming Hall. (See Faculty of Engineering and Applied Science for more on the creation of the Faculty...)", "In 1933, a short circuit started a fire in Fleming Hall and everything above the basement was destroyed. During reconstruction, its pitched roof was replaced by a flat one, reflecting a change in University policy after a fire in the Old Medical Building.", "Fleming Hall, Stewart-Pollock Wing", "Fleming Hall with its various wings honours several figures in Queen's history. The original building was named for Sir Sandford Fleming, who was a noted chancellor of Queen's. The other three honourees were all affiliated with Electrical Engineering, which was located in Fleming Hall until 1989. The Jemmett Wing is named for Douglas Mill Jemmett, who was head of the department for 36 years. The Stewart-Pollock Wing is named in honour of Harold Huton Stewart and Harold Stockwell Pollock, who were both professors of electrical engineering and between the two of them taught at Queen's for 81 years.", "Both wings of Fleming Hall have also housed at various times the campus bookstore, the radio station, a heating and power plant, and the School of Graduate Studies. The Jemmett Wing now houses a variety of administrative research offices, Campus Security, and ITServices (Telecommunications). The Stewart-Pollock Wing hosts the Department of Marketing and Communications and Human Resources."], "desc_src": "https://www.queensu.ca/encyclopedia/f/fleming-hall", "access": [" ", "Entrances", "North/South\nBoth the north and south entrances of the Jemmet wing are non-accessible due to stairs.", "Corridors: There are no doors that act as barriers in the corridors of Jemmett Wing.", "Wayfinding: The signage for this building is located on the wall to the left side of the south and north side entrance.", "Washrooms: There are single-user washrooms on level 2 and 3 of the Jemmett Wing, but they are not accessible. They are in rooms 201B and 314, respectively.", "Parking: Permit parking is available in the lot behind Miller Hall. There is one accessible metered space on Union street across from Miller Hall.", " ", "Link to Jemmet Wing on the Queen's Campus Map", "Link to Jemmet Wing on Google Maps", "Jemmet Wing Floor Plans", "Jemmet Wing Site Plans"], "map": "https://goo.gl/maps/LJzjwVNmH3D4TALU8"}