{"name": "Four Directions Indigenous Student Centre", "coords": ["46.5542435", "-81.1848074"], "addr": "144 & 146 Barrie Street", "images": [{"src": "/images/buildings/four-directions.jpg", "alt": "Street view of Four Directions Indigenous Student Centre."}], "desc": ["", "In 1994, Queen's was awarded a grant by the Ontario government under the Aboriginal Education and Training Strategy. This donation went towards the creation of the Four Directions  Indigenous Student Centre (FDISC), which opened in 1996.", "The FDISC seeks to enhance the development of the Queen's Indigenous community and to provide a space for non-Indigenous students to discover and discuss Indigenous traditions.", "Individual  Indigenous students are given opportunities at this centre for support in their academic, spiritual, physical, and emotional needs.", "The centre also has an extensive  Indigenous Resource Library.", "Learn more about Four Directions Indigenous Student Centre..."], "desc_src": "https://www.queensu.ca/encyclopedia/f/four-directions", "access": ["Location: 144/146 Barrie Street is located on the west side of Barrie St across from City Park, at the intersection of Barrie and Union St.", "Entrances", "East (Main entrances):\n146 Barrie St is wheelchair accessible, and is equipped with a ramp and power door.\n144 Barrie Street has a ramp leading to the front door but also has a notable threshold at the narrow entrance to the door.", "Corridors: The 2nd floors are inaccessible because there is no elevator in either building.", "Ramps: Both buildings have ramps that are accessible from the paved driveway between the buildings.", "Wayfinding: The signage for this building is located on the front of 146 Barrie St, there is a wide paved driveway leading up to the entrances between the buildings.", "Washrooms: 146 Barrie St has one wheelchair accessible washroom located on the first floor. This room is signed \"washroom\" with male, female, and wheelchair symbols indicated on the door. There is no power door. All washrooms in the building are single-user. 144 Barrie St has all single user washrooms.", "Services: Four Directions Indigenous Student Centre is located within these buildings.", "Parking: Permit parking is available in the lot behind the Cataraqui Building; the entrance is off Arch Street. There is time-limited parking on Barrie, Court and Bagot Streets and one accessible meter space on Stuart Street at George Street.", " ", "Link to FDISC on the Queen's Campus Map", "Link to FDISC on Google Maps", "Floor Plans - N/A", "FDISC Site Plans"], "map": "https://goo.gl/maps/f1LdAbryeVspJFtF6"}