{"name": "Richardson Stadium", "coords": [44.22768145, -76.51629581006287], "addr": "366 Hargreaves Way", "images": [{"src": "/images/buildings/george-richardson-memorial-stadium-0.jpg", "alt": "Richardson Stadium"}, {"src": "/images/buildings/george-richardson-memorial-stadium-1.jpg", "alt": "Richardson Stadium"}, {"src": "/images/buildings/george-richardson-memorial-stadium-2.jpg", "alt": "Richardson Stadium 1929"}, {"src": "/images/buildings/george-richardson-memorial-stadium-3.jpg", "alt": "Richardson Stadium 1929"}, {"src": "/images/buildings/george-richardson-memorial-stadium-4.jpg", "alt": "Unveiling of plaques"}, {"src": "/images/buildings/george-richardson-memorial-stadium-5.jpg", "alt": "fans at Richardson Stadium"}, {"src": "/images/buildings/george-richardson-memorial-stadium-6.jpg", "alt": "plaque at Richardson Stadium"}, {"src": "/images/buildings/george-richardson-memorial-stadium-7.jpg", "alt": "plaques at Richardson stadium"}, {"src": "/images/buildings/george-richardson-memorial-stadium-8.jpg", "alt": "Journal article clipping"}, {"src": "/images/buildings/george-richardson-memorial-stadium-9.jpg", "alt": "Richardson Stadium 1929"}, {"src": "/images/buildings/george-richardson-memorial-stadium-10.jpg", "alt": "Richardson Stadium 1929"}, {"src": "/images/buildings/george-richardson-memorial-stadium-11.jpg", "alt": "Unveiling of plaques"}, {"src": "/images/buildings/george-richardson-memorial-stadium-12.jpg", "alt": "fans at Richardson Stadium"}, {"src": "/images/buildings/george-richardson-memorial-stadium-13.jpg", "alt": "plaque at Richardson Stadium"}, {"src": "/images/buildings/george-richardson-memorial-stadium-14.jpg", "alt": "plaques at Richardson stadium"}, {"src": "/images/buildings/george-richardson-memorial-stadium-15.jpg", "alt": "Journal article clipping"}], "desc": ["", "Built in 1971, this stadium on west campus is home to Queen's Gaels football team and is used for a variety of other University and local athletic events.", "The original Richardson Stadium was built in 1920/21 and located on what is now Tindall Field as a gift of James Armstrong Richardson, Queen's Chancellor from 1929 to 1939. The old stadium was home to Queen's great Grey Cup teams of the 1920s and hosted U.S. President Franklin Roosevelt when he received an honorary degree from Queen's in 1938.", "When a new social sciences complex (Mackintosh-Corry Hall) was planned, the original stadium was torn down and relocated to the newly acquired west campus. The demolition of the old stadium in 1971 was mourned by many students and alumni who thought that such a central building should remain in the heart of campus.", "The stadium is named after James Richardson's brother, George Taylor Richardson (BSc 1909), a prominent athlete at Queen's who was killed in action in France during the First World War.", "\n\nRichardson Stadium, 1921, courtesy Wallace R. Berry\n\n", "A stadium revitalization project kicked off in March 2014 with the announcement of a $10 million pledge from Queen’s alumnus and former Gael Stu Lang (Sc'74) and his wife Kim (Artsci'75). That announcement was followed by a $5 million contribution from the Richardson Foundation. Other donors also stepped forward to contribute to the project, bringing the total amount raised to more than $17 million. Queen’s also contributed an additional $3 million for infrastructure support of the stadium, bringing the total funding to $20.27 million.", "On Saturday, Sept. 17, 2016, the revitalized Richardson Stadium was opened to fans for the first time, as the Queen’s Gaels football team hosted the Western Mustangs – the feature event in a weekend-long celebration of athletics and community.", "As the new home for the Gaels football and women’s and men’s soccer teams, the revitalized Richardson Stadium offers integrated and varied seating options and improved sightlines, bringing the fans closer to the field action. An array of enhanced amenities includes a new box office, washrooms, concessions, an upper concourse with access to both sides of the field, a new video board and sound system, modern stadium lighting, and paved parking with reserved access. For the press and media, the stadium is fully TV compatible with designated work stations and TV camera spaces within the new press box.", "On April 15, 2021, Queen’s announced construction on a new pavilion for Richardson Stadium, to be completed by April 2023.", "The pavilion will provide enhanced amenities for student-athletes, coaches, spectators, and community members. Over 300 Queen’s alumni contributed more than $11 million to the project, with the lead gift coming from Stu and Kim Lang.", "When the pavilion is completed, it will provide coaches and student-athletes with modern training and competition spaces as well as athletic therapy, hydrotherapy facilities, meeting rooms, and other sport-related amenities. It will also create a new team room for football that has direct field access. The two-story pavilion will be built to fit into the existing landscape of the West Campus. It will include facilities that will enhance the training and competition environment for varsity sports, expand opportunities for varsity and recreation programs such as intramurals, make usage more gender inclusive, and support a broad range of activities for students and community members.", "For spectators, the pavilion will connect the entire stadium at the concourse level and provide the permanent home of the Gaels Club, which will offer concessions as well as an elevated viewing area. It will also create a new prominent entrance that will serve as the gateway to the stadium.", "Kingston community members will benefit as well, as the pavilion will provide increased access to Richardson Stadium for participants in programs such as the Junior Gaels, which connects local youth with Queen’s student-athletes for mentorship and inspiration.", "In 1971, the two bronze tablets moved to the site of the new Richardson Stadium, joined by a third, presented by Mrs. James Armstrong Richardson. The three plaques were then set into the base of the stadium’s scoreboard.", "Courtesy Queen's Archives", "At the opening of the new George Richardson Memorial Stadium on Oct. 8, 1921, a bronze tablet was unveiled by George Richardson’s friends, “those who knew him best,” reported the Journal, “his former comrades in the field of sport and in the field of war.", "As part of the 2014–2016 revitalization project of Richardson Stadium, the bronze tablets denoting the stadium’s history were also restored and stabilized.", "A reconstructed clipping of Journal article from 1921"], "desc_src": "https://www.queensu.ca/encyclopedia/g/george-richardson-memorial-stadium", "access": ["This building directory entry is under construction", " ", "Link to Richardson Stadium on the Queen's Campus Map", "Link to Richardson Stadium on Google Maps", "Floor Plans - N/A", "Site Plans - N/A                      ", " "], "map": "https://goo.gl/maps/NdQiQLanLMLGGQFk8"}