{"name": "Goodwin Hall", "coords": [44.2279365, -76.49232775576122], "addr": "25 Union Street", "images": [{"src": "/images/buildings/goodwin-hall-0.jpg", "alt": "[photo of Goodwin Hall]"}], "desc": ["", "Goodwin Hall was completed in 1972 as a new home for the Department of Mining Engineering (see The Robert M. Buchan Department of Mining).", "It is named after William Lawton Goodwin, the first director of the School of Mining and Agriculture (the modern day Faculty of Engineering and Applied Science).", "In 1989, Goodwin Hall was linked with the newly constructed Walter Light Hall in a multi-million dollar technology centre to make room for the pressing space needs of the Department of Electrical and Computer Engineering, which had long outgrown its old home in Fleming Hall.", "Goodwin Hall also houses the School of Computing."], "desc_src": "https://www.queensu.ca/encyclopedia/g/goodwin-hall", "access": [" ", "Entrances", "South\nThe main entrance is not accessible.", "East\nThe accessible entrance to the ground level of Goodwin Hall is at the East side of the building under the link to Walter Light Hall. The door has an automatic door opener. The pathway to this entrance is wide and slightly inclined and can be reached from Union Street.\nGoodwin and Walter Light interior links join all levels of the two buildings except the ground floors. An interior link joins level 2 Beamish-Munro and Goodwin Halls with automatic door opener.", "Corridors: There are doors that act as barriers in the corridors. They do not have operator buttons.", "Elevators: An accessible elevator provides access to all levels of Goodwin and Walter Light Halls (except level 1 of Walter Light Hall). The elevator is located near the accessible ground level entrance door. It measures 52” wide and 80” long, with an opening of 42”. The elevator does not have buttons in Braille, an audible announcement system nor is it mirrored. ", "Wayfinding: The signage for this building is located on the right side slanted wall beside the main entrance at the top of the staircase.", "Washrooms: There is an accessible Male washroom located on the ground level. The accessible Female washroom is located on the 2nd (main) level. (Walter Light Hall - You can also use the link to Walter Light Hall for access to the accessible Male washrooms on levels 2, 4, and 7 and the accessible Female washrooms on levels 3, 5, 6). No washrooms are equipped with operator buttons. There are no accessible single-user washrooms in the building.", "Services: There are vending machines on level 2 and assistance phones on floors 3-7, next to rooms 313, 413, 513, 613 and 713.", "Classrooms: Check the classroom website for the accessibility of Goodwin Hall classrooms.", "Parking: Permit parking is available in the lot behind the Goodwin Hall. There is one accessible meter parking space across from Miller Hall on Union Street.", "Water Fountain: All floors are equipped with accessible water fountains with bottle fill stations, directly across from the elevator.", " ", "Link to Goodwin Hall on the Queen's Campus Map", "Link to Goodwin Hall on Google Maps", "Goodwin Hall Floor Plans", "Goodwin Hall Site Plans"], "map": "https://goo.gl/maps/1GRfCcfejy4pyDrn9"}