{"name": "Goodes Hall", "coords": [44.2282853, -76.497659], "addr": "143 Union Street", "images": ["./public/images/buildings/goodes-hall-0.jpg"], "alts": ["[photo of Goodes Hall]"], "desc": ["", "Home to the Smith School of Business, Goodes Hall opened in 2002 and was established through fundraising and the Ontario Superbuild program. The facility is named after Mary and Cedric Goodes, parents of benefactor Melvin Goodes (Com '57).", "At a cost of over $25 million to build, Goodes Hall occupies a renovated and expanded former 1892 schoolhouse, the Victoria School, preserving the building's heritage and combining it with the contemporary design, architecture and cutting-edge learning tools of a modern business school.", "The building is equipped with state of the art information technology systems and video conferencing, greatly enlarged lecture halls, a sophisticated architectural design, and increased resources. The 188,000 square foot facility includes a large central atrium, 16 classrooms, 20 meeting rooms, as well as faculty and administrative offices.", "Goodes Hall was conceived, designed and constructed not just as a building, but also as a community. The guiding principle from the outset was to create a space that would enable maximum interaction between the School’s students, faculty and staff. This new home brought all of the School's faculty, staff, and students under one roof for the first time. ", "The building’s west wing, which opened in 2012, has been LEED ® Gold certified.", "Learn more about the Smith School of Business..."], "desc_src": "https://www.queensu.ca/encyclopedia/g/goodes-hall", "access": ["Location: Goodes Hall is located on Union Street between Alfred and Frontenac Streets.", "Entrances", "South\nThe main entrance on Union Street is accessible. A long ramp with railing leads from Alfred Street to the front door which has an automatic opener. Entrance is to level 1 of the building. There is another entrance that is to the west of the main entrance, also facing Union street that is accessible and equipped with a power door.", "West\nThe west side/Frontenac Street entrance of Goodes Hall is accessible and equipped with a power door.", "Corridors: All corridor doors have power door openers except the vestibule doors of the West entrance on Frontenac Street and two doors on lower level by the Southeastern elevator.", "Elevators: There are four elevators in different locations in Goodes Hall. They offer access to all floors.", "Ramps: The main south entrance has an exterior ramp leading up to it from Alfred Street.", "Wayfinding: Signage for this building is located out front of the main entrance in the lawn area.", "Washrooms: There are accessible washrooms on every floor both Single-user and Multi-user Male/Female with power door and some without power door. Single user washrooms: LL15, LL19, LL204, LL206A, LL206B, 207, 209, 277, 279, 357, 450, 452, 457, 459.", "Parking: Permit parking is available in the underground parking of the building with entrance across Union Street. There are three accessible meter spaces on Alfred Street at Union Street, across the main entrance.", "Water Fountain: There is an accessible water fountain with bottle fill station on the lower level, first floor by washrooms, second floor near west elevator, and the third level beside Room 323.", " ", "Link to Goodes Hall on the Queen's Campus Map", "Link to Goodes Hall on Google Maps", "Goodes Hall Floor Plans", "Goodes Hall Site Plans"], "map": "https://goo.gl/maps/kHmUgW1pnLds9WbC8"}