{"name": "Gordon Hall", "coords": [44.2273938, -76.4945699], "addr": "74 Union Street", "images": ["./public/images/buildings/gordon-hall-0.jpg"], "alts": ["[photo of Gordon Hall]"], "desc": ["Completed in 1911, Gordon Hall was a gift of the government of Ontario and its cornerstone was laid by Premier Sir James Whitney in April 1910. It is named after the Rev Daniel Miner Gordon, principal of Queen's from 1902 to 1917.", "The building was a much needed addition to Queen's and provided a home for the Department of Chemistry for over 90 years until it moved to Chernoff Hall.", "Gordon Hall has been added onto several times. The Gordon Annex, a large wing that projects at right angles from the rear of building, was built between 1947 and 1949. The Frost Wing, named in honour of Grenville Barker Frost, professor of chemistry from 1925 to 1956 and head of the department from 1956 to 1960, was built in 1961 and attached to the south end of the annex. An extra floor was also added to the building in 1964.", "The land on which the annex and the Frost Wing were built held grass tennis courts until the 1940s.", "Extensive renovations in the early 2000s included the demolition of the Frost Wing.", "Reopened in 2006, Gordon Hall is now home to the Office of the University Registrar, Career Services, the School of Graduate Studies, and the Office of the Associate Vice-Principal and Dean of Student Affairs."], "desc_src": "https://www.queensu.ca/encyclopedia/g/gordon-hall", "access": [" ", "Entrances", "North\nThe main entrance in the middle of the building facing Union Street is not accessible due to a staircase leading up to it. However, to the left side of the staircase is an accessible entrance to the ground level of the building that is equipped with a power door.", "Corridors: There are no doors that act as barriers in the corridors.", "Elevators: An accessible elevator provides access to all floors of Gordon Hall.", "Wayfinding: The signage for this building is located on a freestanding sign near the sidewalk.", "Washrooms: There are Multi-user Male and Female designated accessible washrooms on all floors located next to the elevator. They are not equipped with power doors.", "Parking: Permit parking is available in front of the School of Kinesiology at the corner of Union and Division Streets. One accessible metered space is available on Union Street across from Miller Hall.  ", "Water Fountain: There is an accessible water fountain with bottle fill station in the second floor lobby.", " ", "Link to Gordon Hall on the Queen's Campus Map", "Link to Gordon Hall on Google Maps", "Gordon Hall Floor Plans", "Gordon Hall Site Plans"], "map": "https://goo.gl/maps/jRgy2EKopmWHQWV6A"}