{"name": "Grant Hall", "coords": [44.22592655, -76.49511569986325], "addr": "43 University Ave", "images": [{"src": "/images/buildings/grant-hall-0.jpg", "alt": "[photo of Grant Hall]"}, {"src": "/images/buildings/grant-hall-1.jpg", "alt": "[photo of Grant Hall in the summer]"}, {"src": "/images/buildings/grant-hall-2.jpg", "alt": "grant hall in winter"}, {"src": "/images/buildings/grant-hall-3.jpg", "alt": "Grant Hall clocktower plaque"}, {"src": "/images/buildings/grant-hall-4.jpg", "alt": "grant hall in winter"}, {"src": "/images/buildings/grant-hall-5.jpg", "alt": "Grant Hall clocktower plaque"}], "desc": ["", "With its tall limestone clock-tower, this assembly and concert hall, completed in 1905, is Queen's best-known landmark. Fittingly, it is named after Queen's most important principal, George Monro Grant, a national figure in his own right who gave Queen's, for the first time, a national mission and profile.", "The hall seats 900 people and is used for public lectures and meetings, concerts, convocation ceremonies, dances, and exams.", "It was also used as a military hospital during the First World War. During WWII, Grant Hall was used as an entertainment centre for troops and a meal hall (see Wartime at Queen's).", "The building was originally supposed to be funded by the Frontenac County Council and named Frontenac Hall. However, the citizens of Frontenac County voted overwhelmingly against the idea.", "One theory on why Frontenac refused to fund the building states that it was simply too much to ask, as Frontenac was not a rich county and was populated mostly by farmers. The other theory is that the refusal was the result of a grudge: Grant publicly opposed abstemious county councillors' plan to ban the sale of alcohol in the county. As a result, in 1901, they withdrew their support - despite an emotional plea by the now weak and ailing Principal.", "", "Such was the devotion that Grant inspired in his students that they stepped in, raising the necessary $35,000 over the winter of 1901-1902, one third of which came from the students themselves, many of whom lived on the poverty line. They named the building Grant Hall to honour the 25th anniversary of his Principalship in December 1902. Grant, unfortunately, died in May, several months short of that anniversary, and so the building was named for him posthumously on its completion in 1905.", "Grant Hall was designed in the Victorian Romanesque style by Symons and Rae, an architectural firm from Toronto that also designed Kingston Hall and Ontario Hall. The original tower clock, installed in 1905, was an original designed by Nathan Dupuis, a professor of mathematics and other sciences and Dean of Practical Science at the turn of the century. He was assisted by James Connell, the instructor in the Mechanical Laboratory.", "After years of unreliable service, the old clock was replaced in 1993 with an electrical mechanism and - like the building itself - paid for by students as part of the Faculty of Applied Science’s 100th anniversary celebration. The fundraising campaign was led by female Engineering students, with a significant starting student contribution from the THANK Q’92 giving initiative. The new mechanism was designed by Smith’s of Darby in England, and installed by Toronto-based Abernathy and Sons.", "The old clock mechanism is on display in Stirling Hall.", "Grant Hall is located at the south end of University Avenue.", " ", "The back of Grant Hall in the winter.", "A plaque inside Grant Hall Tower recognizes Professor Nathan Dupuis for designing the original tower clock. The inscription reads: \"Designed by Prof N. F. Dupuis and by him presented to Grant Memorial Hall. Constructed in the Mechanical Laboratory of Queens College under the supervision of J. Connell instructor in the laboratory. Erected May 1905.", "The Grant Hall clock tower plaque"], "desc_src": "https://www.queensu.ca/encyclopedia/g/grant-hall", "access": ["Location: Grant Hall is located on University Avenue south of Ontario Hall.", "Entrances", "East\nGrant Hall can be entered through Kingston Hall, there is also a backdoor to the east that non-accessible due to a set of stairs from the parking area in between Kingston Hall and Grant Hall.", "West\nThe main entrance to Grant Hall is accessible and has an automatic door opener. There is access to the main floor only. Access to the stage for an event can be arranged through the event's organizer well in advance.", "Corridors: There are doors that act as barriers in the corridors however these doors remain opener whenever there are programs in Grant Hall. ", "Washrooms: An accessible single-user washroom is located on the main floor near the rear lobby door. It has no power door. Single-user washroom 112.", "Services: There is an emergency phone on level 1 by the back entrance. Contact event organizers for individual event accommodations.", "Parking: Permit parking is available behind of Grant Hall. To get from this parking area to the front entrance of Grant Hall, follow the lane towards Ontario Hall out of the parking lot then turn left. Three accessible meter spaces are located on the South side of Stuart Street opposite the Underground Parking Garage entrance. Accessible parking is also available in the Underground Parking Garage. Exit the Parking Garage through the Kingston General Hospital/Etherington Hall tunnel", "Water Fountain: There is an accessible water fountain with bottle fill station on level 1 outside room 122 (washroom).", " ", "Link to Grant Hall on the Queen's Campus Map", "Link to Grant Hall on Google Maps", "Grant Hall Floor Plans", "Grant Hall Site Plans"], "map": "https://goo.gl/maps/biCkgNGAVqMxjAsw6"}