{"name": "Harrison Le-Caine Hall", "coords": ["44.2253125", "-76.49690796171171"], "addr": "39 Bader Lane", "images": [{"src": "/images/buildings/harrison-lecaine-hall.jpg", "alt": "Street view of Harrison Le-Caine Hall."}], "desc": ["", "The home of Queen's School of Music, Harrison-LeCaine Hall is named after the eminent British musicologist Frank Harrison, the first resident musician at Queen's (1935-1946), and after Queen's graduate, scientist, and composer, Hugh LeCaine, a major figure in the development of electronic music in Canada.", "Completed in 1973 (and said to resemble a grand piano from the air), the building houses classrooms, teaching and practice studios, rehearsal halls, staff offices, electronic and computer music studios, an electronic piano laboratory, and a lounge area.", "It also used to house the music library, which has been moved to Douglas Library as part of the W. D. Jordan Special Collections and Music Library.", "The building underwent significant restorations and renovations in the late 1990s and was re-opened in the summer of 2000. The funds for the construction of the building were a gift from the provincial government.", "It is located on Bader Lane."], "desc_src": "https://www.queensu.ca/encyclopedia/h/harrison-lecaine-hall", "access": [" ", "Entrances", "North\nThis entrance is non-accessible due to stairs.", "South/West\nThe accessible entrance is to the right (south-west) of the main entrance. The door has an automatic opener to the elevator foyer. The entry way is level", "West\nThe main entrance faces onto Bader Lane from the west and is not accessible.", "Corridors: There are no doors that act as barriers in the corridors on levels 1 and 3.", "Elevators: The building elevator allows access to all areas except rooms 220 through 229. It measures 65” by 80” with an entry way of 42”. The elevator is equipped with an audible announcement system, however, buttons are not in Braille, nor is the interior mirrored. The elevator does not serve the mezzanine level.", "Wayfinding: The signage for this building is located outside the North entrance on the right side on a wall.", "Washrooms: A single-user accessible washroom is located on the 2nd floor (room 265) in the corridor near the elevator. The door is not equipped with powered doors.  ", "Services: There is an assistance phone on level 2 near the north entry.", "Parking: Permit parking is available on Bader Lane, in the lot behind Watson Hall and beside Victoria Hall. There are three accessible meter spaces on the north side of Stuart Street opposite the Underground Parking Garage entrance.", "Water Fountain: There is an accessible water fountain with bottle fill station on the lower level by the elevator. ", " ", "Link to Harrison Le-Caine on the Queen's Campus Map", "Link to Harrison Le-Caine on Google Maps", "Harrison Le-Caine Floor Plans", "Harrison Le-Caine Site Plans"], "map": "https://goo.gl/maps/PfCTi3Hg6CvxbxpbA"}