{"name": "Office of Advancement, Faculty of Health Sciences Building", "coords": [44.2258542, -76.490822925], "addr": "102 Barrie Street", "images": [{"src": "/images/buildings/health-sciences-faculty.jpg", "alt": "Street view of Office of Advancement, Faculty of Health Sciences Building."}], "desc": ["The Faculty of Health Sciences was established in 1854 after more than a decade of effort by Queen's officials to add a medical school to the young university.", "It began in a small limestone house at 75 Princess Street, but soon moved to Summerhill, where the rest of the university was located. In 1858, it moved into the first permanent building that Queen's built for itself: the Old Medical Building.", "In 1866, the Faculty split from the University after medical professors, less theologically-minded than their colleagues, protested against having to make a public declaration of Presbyterian faith.", "The Faculty became the Royal College of Physicians and Surgeons, Kingston (RCPSK), which retained a loose affiliation with the University. The RCPSK eventually reunited with Queen's in 1892 in order to share resources and expertise (For more on RCPSK history, see Expulsion of Women Medical Students).", "Planning for a nursing program at Queen's began in 1941. The first students were admitted in the fall of 1942 and the first Director of the School of Nursing was appointed in 1946. In 1979, the School of Rehabilitation Therapy, originally a stand alone unit, became part of the Faculty. And in 1998, the School of Medicine and the School of Rehabilitation Therapy were joined by the School of Nursing to become the current Faculty of Health Sciences.", "The faculty's academic programs are based on campus but are distributed throughout southeastern Ontario's health care facilities through affiliations with the Quinte Healthcare Corporation, Lakeridge Hospital, Peterborough, Perth, Brockville, and Weeneebayko (Moose Factory), amongst many other sites.", "Learn more about the Faculty of Health Sciences..."], "location": "", "entrances": [], "corridors": "", "wayfinding": "", "washrooms": "", "fountains": "", "classrooms": "", "elevators": "", "services": "", "parking": "", "desc_src": "https://www.queensu.ca/encyclopedia/h/health-sciences-faculty", "access": ["This building directory entry is under construction", " "], "map": "https://goo.gl/maps/iTyanXPG6pDg9AGB8"}