{"name": "Humphrey Hall", "coords": [44.226847500000005, -76.49211252228535], "addr": "62 Arch Street", "images": [{"src": "/images/buildings/humphrey-hall-0.jpg", "alt": "[photo of Humphrey Hall]"}], "desc": ["Completed in 1969, this hall houses the main part of Queen's Department of Psychology. The rest of the department is located in the attached Craine Building.", "It is located on Arch Street just north of the Medical Quadrangle. The old Jock Harty Arena was torn down to make room for its construction and relocated to the north side of Union Street.", "It is named in honour of George Humphrey, Professor of Psychology from 1924 to 1947 and a long-time head of the department."], "location": "Humphrey Hall is located on Arch Street north of the Craine Building and across the street from the Biosciences Complex.", "entrances": ["East\nThe main entrance on Arch Street is accessible. The door has an automatic opener. This entrance also provides access to the Craine Building. The vestibule doors to Humphrey Hall and Craine do not have automatic door openers.  ", "West\nThe rear entrance to Humphrey Hall from the Medical Quadrangle is not accessible. The entry does appear accessible but leads to a landing which steps down to the main entrance lobby."], "corridors": "There are doors that act as barriers in corridors. These doors do not have operator buttons. There are no lifts or ramps in corridors.", "wayfinding": "The signage for this building is wall mounted to the right side of the main entrance.", "washrooms": "The accessible washrooms are off the main hallway near the elevator on level 1. There are automatic door openers. There are single-user washrooms on levels 3 (314) and 4 (413) which are not accessible.", "fountains": "There is an accessible water fountain with bottle fill station by room 122 on level 1.", "classrooms": "Check the classroom website for the accessibility of Humphrey Hall's classrooms.", "elevators": "The elevator is in a small corridor halfway down the hallway from the main lobby. The elevator provides access all levels of both Humphrey Hall and Craine Building. Its dimensions are 68” wide by 98” long, with an entrance of 60”. The elevator is not mirrored, there is no Braille or audible announcement system.", "services": "There is an assistance telephone on level one, in the vestibule. Emergency photos can be found on the southern-most points on levels 2, 3, and 4.", "parking": "Permit parking is available in the parking lot behind the building. There is one accessible meter space on Stuart Street at George Street, and one space on Union Street across from Miller Hall.", "desc_src": "https://www.queensu.ca/encyclopedia/h/humphrey-hall", "access": [" "], "map": "https://goo.gl/maps/EmRGddgNEX8pfCTx9"}