{"name": "Isabel Bader Centre For Performing Arts", "coords": ["44.2203498", "-76.506508953843"], "addr": "390 King Street West", "images": [{"src": "/images/buildings/isabel-bader-centre-performing-arts.jpg", "alt": "Street view of Isabel Bader Centre For Performing Arts."}], "desc": ["The Isabel Bader Centre for the Performing Arts is located along the shoreline of Lake Ontario. Embracing the principles of interactivity and integration, the facility is home to the creative arts at Queen's: the Dan School of Drama and Music, the Department of Film and Media, and the Bachelor of Fine Art program all share the teaching and performance spaces within.", "The opening of \"The Isabel,” the nickname applied to the new facility by the Queen’s community, in 2014 was long awaited. For a campus vibrant with academic creativity, Queen’s early years were often short on the performing arts. There were many wonderful performances by the Glee Club, the Faculty Players and student and faculty musicians, but these were hindered by the lack of suitable performance venues. Despite a glorious hammer-vault ceiling, Convocation Hall (which opened in 1878) offered a limited stage and imperfect acoustics. Grant Hall (1905) had 900 seats, but once again the acoustics were challenging and had to contend with winter heating. Other campus stages – in Dunning Hall and McArthur Hall, for instance – alleviated the situation for some kinds of performances.", "A series of student-led initiatives through the 1900s made a performance space seem within reach, but each one eventually fell through. The 21st century dawned and, despite the presence of a thriving School of Music, a bachelor of Fine Arts program, film studies and a cycle of annual drama productions, Queen’s still lacked a big stage. The, in the early 2000s, Drs. Alfred and Isabel Bader expressed their interest.", "The Baders had long supported the visual arts at Queen’s, endowing the Agnes Etherington Art Centre with a trove of European art. Their promise of a lead donation prompted Principal Karen Hitchcock into negotiations in 2006 with the City of Kingston for a choice waterfront site just west of the main campus. Now, Queen’s had sufficient momentum for a performance space.", "By 2009, the financing was in place: a remarkable $31-million in donations from the Baders, followed by $15 million in matching contributions from the federal and provincial governments. Queen’s, the City of Kingston and many other generous donors helped make the Isabel a reality.", "The Centre's building, was designed by Snohetta, a Norwegian architectural firm, and N45 Architects of Ottawa as a partnership of the two firms. It incorporate the existing heritage buildings of the Morton's brewery (1840), stable buildings, and the Stella Buck building into the modern facility.", "In the fall of 2014, the 80,000 square-foot, $72-million Isabel Bader Centre for the Performing Arts opened to architectural and cultural acclaim. The main performance hall with its 566 seats and walls of layered heritage hardwood panelling is complemented by a studio theatre, a rehearsal hall, and a film screening room, all wrapped inside a sculpted exterior of glass and steel. Patrons arrive at the Isabel’s spacious foyer with its sweeping view of Lake Ontario.", "The Globe and Mail hailed the centre as “a masterpiece completed.”", "The Isabel’s first director, Jerry Doiron, proudly described it as “a consummate storytelling space – stories that reveal the human condition for what it is: complex, often confusing and ever beautiful.”", "Learn more: Isabel Bader Centre for the Performing Arts..."], "desc_src": "https://www.queensu.ca/encyclopedia/i/isabel-bader-centre-performing-arts", "access": ["Location: The Isabel Bader Center is located on King Street West, directly beside the Tett Centre and across from St. Mary’s on the Lake.", "Entrances", "North\nThe main entrance is accessible by car and Kingston Transit bus. There is a concrete ramp and gentle sidewalk leading to the front doors accessible with power doors.  ", "West\nThe west entrance to the building (primarily used by faculty/staff) has an accessible ramp next to two accessible parking spaces.", "Corridors: There are doors that act as barriers in the corridors in level 1 that can be kept open. Corridors and rooms have been designed to allow for the turning radius of various mobility devices.", "Elevators: A service elevator is located near the west entrance to levels 1 and 2. Main elevator is located to the right of the main entrance and allows access to upper and lower levels.", "Wayfinding: The signage for the Isabel is located out front of the main entrance.", "Washrooms: There is a large single-user accessible washroom on level 1 (room 170). There are also two additional single-user inaccessible washrooms on this floor along with accessible male and female designated washrooms. Each male and female choral dressing rooms has an accessible washroom and separate accessible shower.", "Services: During events, staff are available at the front desk, to the right of the entrance doors, and are available to assist with accessibility. The lobby bar and café kitchen also have wheelchair accessible counter service areas.", "Classrooms: The performance hall has wheelchair accessible seating on both the main level and the mezzanine level (a total of 14) in various locations and there are also a number of bariatric chairs available, if requested. The film screening room has an accessible podium and two wheelchair accessible seats at the front of the room. There are accessible podiums in the seminar rooms. The performance hall projection room has a lift to make it barrier-free. The performance hall will have a light for an American Sign Language Interpreter on the stage. Some assistive listening devices should be available for use in building, such as in the performance hall and film screening room. More information about classrooms at the Isabel.", "Parking: Parking drop-off area is located at the front entry. Off King Street West, there are 5 accessible visitor parking spaces in the small upper lot across from the entrance.  Two additional spaces are located in the west parking lot at the bottom of the drive-in front of the stage door.  Please contact our Box Office for advice on accessible parking at 613-533-2424.", " ", "Link to The Isabel on the Queen's Campus Map", "Link to The Isabel on Google Maps", "Link to The Isabel Floor Plans", "Isabel Site Plans - N/A"], "map": "https://goo.gl/maps/QtheXRibo2yopJcx9"}