{"name": "Jackson Hall", "coords": [44.22654545, -76.49302114336955], "addr": "35 Fifth Field", "images": [{"src": "/images/buildings/jackson-hall-0.jpg", "alt": "[photo of the original Jackson Hall]"}, {"src": "/images/buildings/jackson-hall-1.jpg", "alt": "[photo of Jackson Hall]"}], "desc": ["When Jackson Hall was first completed in 1907, it was the University's gymnasium. It was not named Jackson Hall until the 1970s and until then was known only by functional names, which changed over time.", "The building originally had a pitched roof and was two stories plus a basement, with the gymnasium proper occupying the first and second stories and a swimming pool and locker rooms located in the basement. The gymnasium had a running track suspended halfway up its wall.", "The building was originally slated to cost only $9,000, but the total figure amounted in the end to more than $27,000. No Kingston architects could be found to construct the building since the budget was so limited and so Professors Alexander Macphail and A.K. Kirkpatrick supervised its construction.", "In 1931, a new gymnasium was constructed and the old gym became the home of hydraulics research. It was also the location of engineering drawing classes for many years, and the man for whom the building is now named - Arthur Jackson - was a Professor of Engineering Drawing.", "The building was radically expanded and renovated with the addition of an extra floor in 1959 and now houses part of the Department of Mechanical Engineering (see Materials And Metallurgical Engineering, Department of)."], "location": "", "entrances": ["West\nJackson Hall is not wheelchair accessible. There is one entrance to the building."], "corridors": "There are doors in corridors to act as barriers. There are no lifts or ramps in corridors.", "wayfinding": "The signage for this building is wall mounted at the top of the stairs on the left side of the main entrance.", "washrooms": "There are 2 single-user, accessible washrooms in this building. On level 1, the single-user women’s washroom is across from the staircase leading to the upper floors on the right of the main entrance. On level 3, the single-user washroom is across from the staircase. The washrooms on level 2 are also single-user, but not accessible. No washrooms have automatic door openers.", "fountains": "There is an accessible water fountain with bottle fill station across from room 109 in the main entrance.", "classrooms": "", "elevators": "", "services": "There is an assistance telephone just left of main entrance on level 1.", "parking": "Permit parking is located to the north of Jackson Hall in Miller lot.", "desc_src": "https://www.queensu.ca/encyclopedia/j/jackson-hall", "access": [" ", " "], "map": "https://goo.gl/maps/Q4wEciX3ryeFXZm6A"}