{"name": "Jeffery Hall", "coords": [44.22591475, -76.49609724764173], "addr": "48 University Avenue", "images": [{"src": "/images/buildings/jeffery-hall-0.jpg", "alt": "[photo of Jeffery Hall]"}], "desc": ["", "Completed in 1969, Jeffery Hall is named after Ralph L. Jeffery, Head of Mathematics and Chair of Graduate Studies from 1943 to 1960.", "The building was designed with three floors underground and three floors above ground so that it would not detract from the tower of Grant Hall on the opposite side of University Avenue.", "Jeffrey Hall houses the Department of Mathematics and Statistics."], "desc_src": "https://www.queensu.ca/encyclopedia/j/jeffery-hall", "access": [" ", "Entrances:", "East\nThere are two accessible entrances from the front of the building, north and south of the exterior court yard along University Ave. The North door is equipped with a power door. The foyer also has a door with an automatic opener as well. Note: Upon entry from ground level, you are on level 3 of the building. In the lobby is the elevator.", "Corridors: There are doors that act as barriers in the corridors. These doors are not equipped with operator buttons. There are no lifts nor ramps in corridors.", "Elevators: An accessible elevator is located centrally in the building and provides access to all levels of the building. The elevator measure 60” wide and 46” long, with an entrance way of 36”. The elevator does not have an audible announcement system, buttons are not in Braille nor are there any mirrors inside the elevator. ", "Washrooms: There is an accessible single-user washroom on level 1 without power door. It is south of the lecture halls, room 126.  ", "Services: There is an emergency phone in the front vestibule in level 3.", "Classrooms: Check the classroom website for the accessibility of Jeffery Hall classrooms.", "Parking: Permit parking available on Bader Lane and in the underground parking garage on Union Street west of the building and the surface lot on Albert Street. There is a ramp from the parking lot, located between Mackintosh-Corry Hall and Robert Sutherland Hall which leads through Richardson courtyard to University Avenue. There are 3 accessible meter spaces on Stuart Street opposite the underground parking entrance.", "Water Fountain: There is a water fountain with bottle fill station on level 1, across from room 133, on level 2 near the study room, and level 3 across from room 315 and 314.", " ", "Link to Jeffery Hall on the Queen's Campus Map", "Link to Jeffery Hall on Google Maps", "Jeffery Hall Floor Plans ", "Jeffery Hall Site Plans "], "map": "https://goo.gl/maps/BcNpsfkvDpCPA1mj9"}