{"name": "John Deutsch University Centre", "coords": [44.22843555, -76.49489106538806], "addr": "87 Union Street", "images": [{"src": "/images/buildings/john-deutsch-university-centre-0.jpg", "alt": "[photo of the Students' Memorial Union in 1929]"}, {"src": "/images/buildings/john-deutsch-university-centre-1.jpg", "alt": "[photo of the John Deutsch University Centre]"}], "desc": ["Students' Memorial Union in 1929", "Located at the northeast corner of University Avenue and Union Street, the John Deutsch University Centre (JDUC) is used by students, staff, faculty, and alumni for a variety of purposes. It houses the Alma Mater Society (AMS) offices, the Queen's Pub, Alfie's, the Memorial Room, and was the original home of the Common Ground before it moved to the Queen's Centre.", "The centre is located on the site of Kingston's old Orphan's Home, a large and handsome building constructed in 1862 that was purchased by Queen's in 1927 to serve as the Students' Memorial Union, named in commemoration of students who died during the First World War.", "The early Union was essentially a men's club, housing a cafeteria, meeting and reading rooms, and student society offices - almost all of which were closed to women. After the building was destroyed by a serious fire on September 4, 1947, the main part of the present JDUC was constructed in its place with the help of a large donation from Col. R.S. McLaughlin.", "Even in the new building, women were initially permitted only in business offices, including those of the  Queen's Journal  and AMS, and in the \"Co-ed Lounge,\" a room just off Wallace Hall known today as the Polson Room.", "Beginning in the mid-1950s, women were permitted to enter all parts of the building, except for Wallace Hall, which remained off limits except during formal dinners until 1960.", "The Union was extensively renovated and expanded in the mid-1970s in response to the tripling of the student population since the 1950s. It was renamed the John Deutsch University Centre at the same time in honour of former Principal John Deutsch, who died in 1976.", "At the heart of the JDUC is the ceilidh, a large open space where members of the community gather for concerts, performances, debates, and displays."], "location": "The John Deutsch University Center, or J.D.U.C. is located on the northeast corner of University Avenue and Union Street.", "entrances": ["North\nThe back entranceway is also non-accessible because it enters into a stairwell leading to the main floor and basement levels.", "South (main)\nThis entrance faces Union Street and is inaccessible as there are staircases leading to the ground floor and first floor entranceways.", "West (main and accessible)\nThere are two west facing entranceways on University Avenue, one has a staircase leading up to the first floor, the other is accessible and enters into the ground floor of the building.\nThe accessible entrance is located on University Avenue. A concrete ramp provides access to the ground floor near the food service area. The door has an automatic opener.", "Water Fountain: Accessible water fountains with bottle fill stations are located on the first floor by the North entrance and on the 2nd floor across from the Tri-Colour Outlet."], "corridors": "There are doors that act as barriers in the corridors.", "wayfinding": "The signage for this building is located to the side of the main entrances.", "washrooms": "There are single-user accessible washrooms on all floors except the basement. Ground and first floor single-user washrooms have automatic door openers. Single user washrooms: 075A, 180A, 206A, 354, 356.", "fountains": "", "classrooms": "", "elevators": "There are two elevators, one service elevator and another for public use. The elevator for public use is small.   The elevator is located in a small hallway off the lower lobby or \"Lower Ceilidh\". It provides access from the ground level to level 3. A key is required to access levels 4 and up.", "services": "The John Deutch University Center is equipped with the S.G.P.S Family Room. This is a space with a changing room for infants and is a safe and quiet space for breastfeeding. For access retrieve the key from the Student Life Services front-desk, located on the main-floor. The space is equipped with comfortable seating, electrical outlets, and educational information.\nThe Student Life Center or S.L.C front desk is open from 8:00am to 12:00am daily during the school year and 9:00 am to 4:00pm daily in the summer. Front desk staff are available to assist users. The front desk is located on the second floor on the south side of the building.", "parking": "Permit parking is available in the lot under the Athletics and Recreation Center and in the unpaved lot north of Stauffer Library (enter off University Avenue). There is one accessible meter space on Union Street across from Miller Hall and two accessible meter spaces on Earl Street at the main entrance of the ARC.", "desc_src": "https://www.queensu.ca/encyclopedia/j/john-deutsch-university-centre", "access": ["The John Deutsch University Center is currently under construction.", " "], "map": "https://goo.gl/maps/TaCpk9jBXzsxRP2FA"}