{"name": "Kathleen Ryan Hall", "coords": [44.226611, -76.492435], "addr": "50-A Arch Street", "images": [{"src": "/images/buildings/kathleen-ryan-hall-0.jpg", "alt": "[photo of Kathleen Ryan Hall]"}], "desc": ["", "Kathleen Ryan Hall has been standing for almost 100 years, but its present function and name are relatively new developments in its history. Built in 1907, it was originally called the \"New Medical Building,\" built to accommodate the Department of Medicine, which had outgrown its home in the Old Medical Building.", "The building continued to be used for medical purposes for many years. During WWII, Queen's professors working for the Canadian government used the building in their research on the use of anthrax and botulism in biological warfare, a fact that was kept secret for decades. Guards posted at the building were ordered to shoot trespassers (see Wartime at Queen's).", "In 1981, Queen's graduate (BA 1926) and university Councillor Kathleen Ryan donated the funds required to renovate the New Medical Building and turn it into a home for the university archives.", "The archives were a long standing institution at Queen's but had until that time been housed in the Queen's libraries where there never seemed to be enough space. There had been a full-time archivist at Queen's since 1960 and when Kathleen Ryan Hall re-opened in 1982 as the new home of the archives, it was a strong step forward for the preservation of history at Queen's.", "Aside from university records, the archives hold records for the City of Kingston, the personal papers of many alumni and faculty, and the papers of some famous Canadian artists and politicians. There are extensive photograph collections, sound recordings, videos, and artifacts from the University and Kingston communities.", "Kathleen Ryan Hall makes up the north end of the historic medical quadrangle."], "desc_src": "https://www.queensu.ca/encyclopedia/k/kathleen-ryan-hall", "access": ["Location: Kathleen Ryan Hall is located between Jackson and Humphrey Halls, facing Summerhill.", "Entrances", "North\nThe accessible entrance is on the north side of the building off the Miller Hall parking lot. There is a concrete ramp with a slight slope. During office hours, use the bell next to the door and someone will unlock it. It is equipped with an operator button.", "South\nThe main entrance to Kathleen Ryan Hall is not accessible due to stairs.", "Corridors: There are no doors that act as barriers in the corridors.", "Elevators: The elevator is located near the accessible entrance. It measures 42” by 71” with an entrance of 36”. The elevator does not have Braille buttons, an audible announcement system or mirrors.", "Washrooms: There are single-user accessible washrooms on levels 1 (room 110), 2 (room 210), 3 (room 310), and 4 (room 410); all are beside the elevator.", "Parking: Permit parking is available in the Miller Hall parking lot. There is one accessible meter space on Stuart Street in front of Botterell Hall.", "Water Fountain: There is an accessible water fountain with bottle fill station on level 1, by room 110.", " ", "Link to Kathleen Ryan Hall on the Queen's Campus Map", "Link to Kathleen Ryan Hall on Google Maps", "Kathleen Ryan Hall Floor Plans", "Kathleen Ryan Hall Site Plans"], "map": "https://goo.gl/maps/Td3CJRPjnv9rceUeA"}