{"name": "Macklem House", "coords": [44.223037500000004, -76.49062691333333], "addr": "18 Barrie Street", "images": [{"src": "/images/buildings/katherine-bermingham-macklem-house-0.jpg", "alt": "Katherine Bermingham Macklem"}, {"src": "/images/buildings/katherine-bermingham-macklem-house-1.jpg", "alt": "Portrait of Oliver Tiffany Macklem"}, {"src": "/images/buildings/katherine-bermingham-macklem-house-2.jpg", "alt": "Two young Macklem boys on the Macklem House Lawn."}, {"src": "/images/buildings/katherine-bermingham-macklem-house-3.jpg", "alt": "Image of child's tri-colour knitted sweater"}, {"src": "/images/buildings/katherine-bermingham-macklem-house-4.jpg", "alt": "Peter Macklem grad photo"}, {"src": "/images/buildings/katherine-bermingham-macklem-house-5.jpg", "alt": "Dick Macklem grad photo"}, {"src": "/images/buildings/katherine-bermingham-macklem-house-6.jpg", "alt": "Katherine Bermingham Macklem"}, {"src": "/images/buildings/katherine-bermingham-macklem-house-7.jpg", "alt": "Portrait of Oliver Tiffany Macklem"}, {"src": "/images/buildings/katherine-bermingham-macklem-house-8.jpg", "alt": "Two young Macklem boys on the Macklem House Lawn."}, {"src": "/images/buildings/katherine-bermingham-macklem-house-9.jpg", "alt": "Image of child's tri-colour knitted sweater"}, {"src": "/images/buildings/katherine-bermingham-macklem-house-10.jpg", "alt": "Peter Macklem grad photo"}, {"src": "/images/buildings/katherine-bermingham-macklem-house-11.jpg", "alt": "Dick Macklem grad photo"}], "desc": ["The Katherine Bermingham Macklem House, located at 18 Barrie Street, was donated to Queen’s University in 1993. There is a long history of the house and family who resided on this property near the edge of Queen’s campus at King and Barrie Streets.", "In the year 1830, architect Thomas Rogers built what was said to be a modest home at 18 Barrie Street. The house was altered to be larger in 1865 after being occupied by a variety of Kingstonians, and at this time was still known as the “Rogers Property.” Not until May 1, 1905, was the house acquired by the Bermingham family. The house was sold to Sarah Francis Bermingham, the wife of Cornelius Bermingham, for $8,500. This couple would later be aunt and uncle to Katherine Bermingham Macklem. For more information about Katherine Bermingham Macklem’s “Uncle Con and Aunt Sally,” you can visit 18 Barrie Street and read Mrs. Macklem’s short account of the Bermingham’s home and family history, entitled The Berminghams of Kingston.", "Cornelius and Sarah Bermingham further added to and remodeled the house, adding the two–-story portico at the East side of the house. This addition, which was the house’s final expansion, was completed in 1906. Today, the house remains as it was designed more than 100 years ago by architect Frank Lent, from Gananoque.", "Following Cornelius Bermingham’s death in 1932, the house was bequeathed to his brother, Christopher William Bermingham, who is the father of Katherine Bermingham Macklem, the final owner and donor of the house. As Katherine explains in The Berminghams of Kingston, “[Cornelius] left his house at 18 Barrie Street to my father. It was really a white elephant to him as he was quite happy in his own house, \"Otterburn,\" so in 1934, as I was the only one of his children who had settled down in Kingston, and because my husband loved it and could afford to run it, he sold it to me for $1.00, and I have lived in it ever since.”", "Katherine Bermingham Macklem lived in the home for over 50 years. In 1927, she married Oliver Tiffany Macklem in Kingston, Ontario. She and “Tiff” had two sons named Oliver Richard and Peter Tiffany Macklem, who both grew up in the house at 18 Barrie Street. Both Macklem boys attended Queen’s University.", "“Dick,” as Oliver Richard was called, entered Queen’s Commerce following high school. He was highlighted in a local Kingston newspaper article Kingston Boys Win Scholarship having been awarded The Richardson Memorial Scholarship, valued at $220, upon his entry to Queen’s in 1948. Dick graduated from Queen’s in 1951. [CONFIRM]", "The Macklem boys were thought by their family to be a military-bound since the Macklem boys’ father, Mr. Tiffany Macklem, had been the department head of civil engineering at the Royal Military College (R.M.C.) and was connected to the college for many years. At the Queen’s Archives in a Macklem family scrapbook you can find a tiny knit tricolor sweater made for Dick, which Mrs. Macklem described in a caption: “Queen’s sweater knit for you…when you were two weeks old for a practical joke…everyone took it for granted you would go to R.M.C.” (Macklem Family fonds).", "Dick’s younger brother, Peter Tiffany Macklem, also attended Queen’s University. He graduated from the Faculty of Arts in 1952 and went on to obtain his medical degree from McGill University in 1956. Our Queen’s University family is privileged to acknowledge Dr. Peter Macklem as one of Canada’s most famous physicians. Dr. Macklem pioneered the field of respiratory physiology in which he contributed to the understanding of early pulmonary damage as a result of smoking. “Dr. Macklem was a remarkably creative and prolific scientist who contributed a number of seminal ideas to the field of respiratory medicine” (CITE - CMHF, 2012 page). Dr. Macklem was elected a Fellow of the Royal Society of Canada (1982), Officer of the Order of Canada (1988), and was posthumously inducted into the Canadian Medical Hall of Fame (2012).", "Mrs. Katherine Bermingham Macklem, Dick and Peter’s mother, continued her connection to medical students while living at Macklem House, which is nearby Queen’s medical buildings. Stories suggest that Mrs. Macklem surrounded herself with medical students who boarded in the house while they attended Queen’s for their medical training. One boarder is quoted to have said they “had the privilege of rooming at the Macklem house” (Reznick, 2012CITE-dean’s blog page).", "Upon Katherine Bermingham Macklem’s death, her two sons Peter Tiffany Macklem and Oliver Richard Macklem helped facilitate its donation to Queen’s University. Following its donation and with the help of Heritage Preservation Consultants, Queen’s commissioned the restoration of the house to its 1906 glory, including both the interior and exterior of the house. Noting the house’s presence, it is written in Buildings of Architectural and Historical Significance, Vol. 2, “This house commands attention as it is on a prominent corner overlooking two areas of Macdonald Park” (p. 146). A noteworthy architectural element of the house is the Classical Revival portico with four tall columns in the Ionic order, which are repeated on the single–story verandah. The columns are continued within the interior of the house in dark wood with leaf-patterned capitals, and are accompanied throughout most of the house with dark-stained oak doors, stairs, railings, and coffered ceilings.", "Today, the Queen’s University Faculty of Health Sciences decanal offices occupy the Katherine Bermingham Macklem House. On May 26, 2018 the house was featured on the Kingston Symphony Association’s Music Lovers’ House Tour. On that day, over 400 visitors were welcomed into the house to hear music, learn about the house’s history, and appreciate its grandeur.", "Katherine Bermingham Macklem, former owner of “Macklem House” at 18 Barrie St.", "1939, Oliver Tiffany Macklem, R.M.C 1905, McGill 1908. Mr. Macklem was a military man, professor and department head of civil engineering at R.M.C before retiring in 1938", "Young Peter(left) and Dick(right) Macklem on the Macklem House Lawn.", "At the Queen’s University Archives, the Macklem family scrapbook had this tiny knit tricolor sweater made for Dick.", "1952, Peter Macklem, Queen’s Arts’52, McGill Medicine ’56. Dr. Macklem became a highly respected Canadian physician for his contributions to the field of respiratory physiology. He was elected Office of the Order of Canada 1988.", "1951, Dick Macklem, Queen’s Commerce ‘51", "Contributed by Lindsay Mainhood, M.Ed., research assistant for the Faculty of Health Sciences Communications and Marketing Team (2018)."], "location": "", "entrances": ["Main Entrance\n18 Barrie Street is not wheelchair accessible. The entrance is on the East side of the building."], "corridors": "", "wayfinding": "", "washrooms": "Washrooms\nThere are three single-user non-accessible washrooms", "fountains": "", "classrooms": "", "elevators": "", "services": "", "parking": "", "desc_src": "https://www.queensu.ca/encyclopedia/m/katherine-bermingham-macklem-house", "access": [" ", "Elevator\nThere is no elevator in the building. Floors 2 and 3 are inaccessible.", " "], "map": "https://goo.gl/maps/YVAZZwzj6qSHkJZq5"}