{"name": "School of Kinesiology and Health Studies", "coords": [44.2285525, -76.4934547], "addr": "28 Division Street", "images": ["./public/images/buildings/kinesiology-and-health-studies-school-0.jpg"], "alts": ["[School of Kinesiology]"], "desc": ["", "The School of Physical and Health Education was founded in 1946, primarily to train students as physical education teachers. In May 2006, it was renamed the School of Kinesiology and Health Studies.", "In its curriculum, professional activities, and research initiatives, the School incorporates the World Health Organization's assertion that health is: \"the state of complete physical, mental, and social well-being - not merely the absence of disease and infirmity.\"", "The School moved into a new state of the art building, simply called the School of Kinesiology and Health Studies (SKHS) Building, in January 2010.", "Learn more about the School of Kinesiology and Health Studies..."], "desc_src": "https://www.queensu.ca/encyclopedia/k/kinesiology-and-health-studies-school", "access": ["Location: The School of Kinesiology and Health Studies is located on the corner of Division and Union Street.   ", "Entrances", "South (accessible):\nThere is an alternative entrance on the south side of the building which also has power door operators.", "East (main & accessible):\nThe main entrance is accessible from the east side on Division Street. There are powered doors that enter onto the main floor.", "Corridors: Corridors are mostly free of obstruction with power door openers wherever there are doors.", "Elevators: An accessible elevator offers access to all floors in the buildings.", "Wayfinding: The signage for this building is located beside the main entrance doors.", "Washrooms: Multi-stall accessible washrooms are available on each floor.", "Classrooms: Check the classroom website for the accessibility of School of Kinesiology and Health Studies classrooms. ", "Parking: Permit parking is available in the lot to the south of the building. Hourly parking is also available on Division Street.", "Water Fountain: There is an accessible water fountain with a bottle fill station in the first floor lobby near the washrooms.", " ", "Link to School of KHS on the Queen's Campus Map", "Link to School of KHS on Google Maps", "School of KHS Floor Plans", "School of KHS Site Plans"], "map": "https://goo.gl/maps/jZaesKW2yWthKzhM8"}