{"name": "Kingston Hall", "coords": [44.2258879, -76.4962353], "addr": "103 Stuart Street", "images": ["./public/images/buildings/kingston-hall-0.jpg", "./public/images/buildings/kingston-hall-1.jpg"], "alts": ["[photo of Kingston Hall]", "[photo of Kingston Hall in 1918]"], "desc": ["", "Completed in 1903, the funding for this hall was donated to Queen's by the City of Kingston to provide much-needed classroom and library space for the Faculty of Arts and Science. Officially named for the city, it was long known instead as the New Arts Building to distinguish it from the Old Arts Building next door, now known as Theological Hall.", "Kingston Hall was designed in the Victorian Romanesque style by Symons and Rae, an architectural firm from Toronto.", "Along with the attached Grant Hall, Kingston Hall served as a military hospital during the First World War. During the Second World War, it was used as a training barracks for attendees of an army course in 1943-1944 (see Wartime at Queen's).", "The building was seriously damaged by smoke and water in 1931 after a fire that began when a student left a smouldering cigarette butt in the women's washroom. Citizens of Kingston donated the money for the repairs.", "Today, Kingston Hall is home to several of Queen's language departments.", "", "Kingston Hall, 1918", "Built in 1917 and torn down in 1925, this one-storey wooden building served as a kitchen and dining room for the military hospital that was located in Grant Hall and Kingston Hall during the First World War. After the war, it served as a cafeteria for staff, students, and faculty, and was commonly known as Marshall Reid's restaurant, after its proprietor.", "The annex was located between Kingston Hall and Theological Hall."], "desc_src": "https://www.queensu.ca/encyclopedia/k/kingston-hall", "access": ["Location: Kingston Hall is located south of Grant Hall with the front entrance facing Nixon Field.", "Entrances", "North\nThere is a back door entrance that is not accessible due to stairs.", "South (main)\nThe main entrance to Kingston Hall is not accessible due to stairs leading up to the entrance.", "South/West (accessible)\nThe accessible entrance is at the southwest corner of the building. A concrete ramp with a railing leads to a door with an automatic opener. Proceed through the door and down another ramp to level 1.", "Corridors: There are doors that act as barriers in the corridors. There is an interior ramp that leads to the accessible entrance/exit.", "Elevators: An elevator with audio capability is located just past the ramp on level 1, provides access to all building levels.", "Washrooms: Accessible washrooms are located on level 1 only. They do not have power doors and are not marked with the accessible symbol. The women's washroom is located near the East stairs and the men's is near the central stairs. There are doors without automatic openers on the corridor before the washrooms. There are no accessible single-user washrooms in the building", "Services: There is an assistance phone on level 2 by the main stairs.", "Classrooms: Check the classroom website for the accessibility of Kingston Hall classrooms.", "Parking: Permit parking is available at the rear or north side of the building. To get from this parking area to Kingston Hall's accessible entrance, follow the lane towards Ontario Hall out of the parking lot then turn left towards University Avenue. Follow the sidewalk past Grant Hall then turn left at Kingston Field. Three accessible meter spaces are located on the north side of Stuart Street across the Underground Parking Garage. Accessible parking is also available in the Underground Parking Garage. Exit the Parking Garage through the Kingston General Hospital/Etherington Hall tunnel.", "Water Fountain: There is an accessible water fountain with bottle fill station on level 1 across from room 108.", " ", "Link to Kingston Hall on the Queen's Campus Map", "Link to Kingston Hall on Google Maps", "Kingston Hall Floor Plans", "Kingston Hall Site Plans"], "map": "https://goo.gl/maps/gA2gydDXLBCJNynx9"}