{"name": "The Law Building", "coords": [44.22743095, -76.49687565290571], "addr": "128 Union Street", "images": [{"src": "/images/buildings/law-building-0.jpg", "alt": "[photo of Sir John A. Macdonald Hall]"}], "desc": ["Completed in 1960, this building houses Queen's Faculty of Law. The building has undergone a number of renovations over the years and now features a Moot Court room, as well the Lederman Law Library.", "The building was previously known as \"Sir John A. Macdonald Hall, named after Sir John A. Macdonald, who grew up and practised law in Kingston and helped to found Queen's before embarking on the political career that made him Canada's first Prime Minister.", "On October 19, 2020, Queen’s Board of Trustees today approved the university’s decision to remove the name “Sir John A. Macdonald” from the law school building, as recommended by Principal and Vice-Chancellor Patrick Deane following his acceptance of recommendations made by Dean Mark Walters, Dean of Faculty of Law, and a report from a special committee set up to consider the situation.", "“This decision is grounded in the university’s present-day academic mission and commitment to honour the values of equity, diversity, and inclusivity and to ensure all students, faculty, and staff feel welcome within the Queen’s community,” says Principal Deane. “It also supports our commitment to take action to address systemic racism and ensure every member of our community may enjoy the benefits of our institution equally.”", "The decision follows a two-month public consultation process that saw more than 3,000 members of the Queen’s community and others submit feedback to the Macdonald Hall Consultation Advisory Committee. The decision honours the university’s commitment to support equity, diversity, and inclusivity and the special responsibility of law schools included in the Truth and Reconciliation Commission Report.", "“Sir John A. Macdonald is rightly celebrated for his central role in the founding of modern Canada and the creation of our country’s constitution. However, a more complete understanding of his legacies has emerged in recent years. In particular, we now have a richer and better understanding of the hurtful views and policies he and his government advanced in relation to Indigenous peoples and racial minorities,” said Dean Mark Walters. “What was made clear through our consultations is that the Macdonald name sends a conflicting message that interferes with the values and aspirations of the current law school and Queen’s community where Indigenous and racialized students must feel welcome and included.”"], "location": "The Law Building is located on Union Street, east of the Robert Sutherland Building.", "entrances": ["North (main & accessible):\nThe main entrance is accessible with a level entry and automatic door opener. ", "South (accessible):\nA ramp between Mackintosh Corry Hall and Policy Studies Building leads to this entrance. There is an automatic door opener."], "corridors": "There are doors that act as barriers in corridors, however they are equipped with door operator buttons. ", "wayfinding": "The signage for this building is located on a freestanding sign to the right side of the main entrance.", "washrooms": "Accessible single-user washrooms are located on level 1, 2, and next to the library, on level 3 (staff lounge). Washrooms doors are equipped with operator buttons except the 3rd floor washroom. Multi-user accessible washrooms are on level 1 without automatic door opener.", "fountains": "There is an accessible water fountain with bottle fill station in the lower level by room 001, 100, on the second floor near room 201, and on the third floor by room 301.", "classrooms": "", "elevators": "All building levels are accessible. There is an elevator near the main entrance and one on the east wall between level 1 and level 0 lecture halls/auditoriums. The main entrance elevator measures 52” by 80” with an entry way of 42”. The east elevator measures 52” by 68”. There is also a central elevator running between levels 1 to 3. Neither elevator is equipped with an audible announcement system or Braille buttons nor is either mirror lined.", "services": "For more information on library accessibility check the Lederman Law Library website. Library staff can assist users.", "parking": "Permit parking is available for the underground parking garage on Union Street west of the building and the surface lot on Albert Street. There are 3 accessible meter spots on Alfred Street at Union Street just across from the building.", "desc_src": "https://www.queensu.ca/encyclopedia/l/law-building", "access": ["Check the classroom website for the accessibility of  The Law Building classrooms.", " "], "map": "https://goo.gl/maps/BSEr4gAduoURLpVNA"}