{"name": "Louise D. Acton Building", "coords": [44.22382, -76.49150048400827], "addr": "31 George Street", "images": [{"src": "/images/buildings/louise-d-acton-building-0.jpg", "alt": "[photo of Louise D. Acton Building]"}], "desc": ["", "Constructed in 1963 and located on George Street, this building houses Queen's School of Rehabilitation Therapy and the Glaxo-Wellcome Clinical Education Centre.", "The building, which was acquired from Kingston General Hospital in 1989, is named after Louise D. Acton, a former director of the hospital's School of Nursing."], "desc_src": "https://www.queensu.ca/encyclopedia/l/louise-d-acton-building", "access": [" ", "Entrances", "North/East\nAn accessible entrance is located at the back of LDA, north of the O'Kill Street entrance and faces the Cancer Research Institute. Its ramp has two turns and handrails. The doors have automatic openers and lead to the building lobby.", "South/East\nThe entrance at the southeast corner of LDA from O'Kill Street is accessible with a ramp. Once inside the building there is another ramp to a door to the lower level. Both doors have automatic openers. ", "West\nThe main entrance is not accessible due to stairs.", "Elevators: The main elevator for LDA is located at the back of the lobby. The Clinical Education Centre has an elevator that serves both Centre’s floors. It is located just inside the Centre's main entrance.", "Washrooms: Accessible washrooms are located on all floors and in the Glaxo Welcome Clinical Education Centre. Washrooms are equipped with change tables. Single user washrooms: 12-028, 125, 126, 222CL, 223CL.", "Parking: Permit parking is available in the lot behind Louise D. Acton building. Two accessible meter spaces are located on O'Kill Street.", "Water Fountain: Accessible water fill stations are located in the lobby across from the elevator.", " ", "Link to Louise D. Acton Building on the Queen's Campus Map", "Link to Louise D. Acton Building on Google Maps", "Louise D. Acton Building Floor Plans", "Louise D. Acton Building Site Plans"], "map": "https://goo.gl/maps/fLLNTURdXuUvYeB68"}