{
  "name": "Mackintosh-Corry Hall",
  "coords": [44.2269861, -76.4971144],
  "addr": "68 University Avenue",
  "images": [
    {
      "src": "/images/buildings/mackintosh-corry-hall-0.jpg",
      "alt": "[photo of Mackintosh-Corry Hall]"
    }
  ],
  "desc": [
    "Completed in 1973, Mackintosh-Corry Hall, or as it is more commonly known, \"Mac-Corry,\" was completed in 1973 as a new Arts and Social Science complex. It sits on the former site of George Richardson Memorial Stadium.",
    "Mac-Corry Hall is home to several departments and institutes, as well as a cafeteria, study and seminar rooms.",
    "It is named after two well-known principals: James Alexander Corry and William Archibald Mackintosh."
  ],
  "location": "Mackintosh-Corry Hall is located on University Avenue, down a pathway that runs between Richardson and Ellis Halls.",
  "entrances": [
    "North\nTo access the building's north entrance proceed up the long, narrow, moderately inclined, concrete ramp next to The Law Building. The door has an automatic opener. The entrance is at the B2 level, near the International Programs Office and the food service area. This entrance can also be reached from underground parking below Tindall Field.",
    "South\nThe building's southwest entrance is accessed by ramp. The entrance opens onto level D1 (lower level). The door has an automatic opener. There is an additional south entrance that has stairs leading up to it.",
    "East\nThere is an eastside entrance located in the middle of the building that has stairs leading up to it. It enters into the space where the cafeteria is and there are additional steps inside the entrance behind two sets of doors to get up to the mail floor and access to the elevator.",
    "West\nThe middle building entrance adjacent to Tindall Field has a railing and handrail. The doors have automatic openers to the D2 level.",
    "Other entrances\nThere are three internal entrances to Mackintosh Corry Hall from neighboring buildings: \nThrough Robert Sutherland Hall: Robert Sutherland Hall levels 3, 4, and 5 to Mackintosh Corry Hall C wing, levels 3, 4 and 5. There are no automatic door openers at any of these levels. \nThrough The Law Builidng: Law Building level 5 to Mackintosh Corry Hall B5 there is no automatic door opener. \nThrough Dunning Hall: Dunning Hall level 1 is linked to Mackintosh Corry A3 by a very short, steep ramp with handrail. There are power doors"
  ],
  "corridors": "There are doors that act as barriers in the corridors. These doors are not equipped with operator buttons. The building has two parts, Northern and Southern, separated by a set of stairs that makes movement from D and E wings, Southern Part, to A,B,C,E and F wings Northern Part. ",
  "wayfinding": "There is signage for the building outside of the main entrances to the building, which there are many.",
  "washrooms": "Accessible washrooms are located on the B2 level across from the food services area (the men’s washroom has an automatic door opener), the D2 level and D3 level near the elevator (both men’s and women’s have an automatic door opener). There is single-user accessible washrooms on B2 level need the food services area. All-user washrooms: B245B and D500.",
  "fountains": "On level 5, between rooms D515 and D519, there is an accessible bottle fill station. There is also an accessible bottle fill station on level 5 in the C wing.",
  "classrooms": "Check the classroom website for the accessibility of Mackintosh Corry Hall classrooms",
  "elevators": "Two elevators service the building. They are located near the accessible exterior entrances: The elevator in B wing is located across from the food service area and near the washrooms. The D wing elevator is on the Southern wall.  Both elevators measure 51” by 81”, with entrances of 42”. Neither is mirrored, and both are equipped with an audible announcement system and Braille buttons.",
  "services": "There are assistance phones in the north ends of B1, C1, B2 and C2. A bank machine can be found in the north end of C2. Further, there is a food court on level 2 in the C wing. A one-person wheelchair lift, near the entrance from the parking lot, links the D2/E2 level with the B2 level. A number code is required to operate the lift. Students can obtain this code and user information from Student Wellness Services. The code can also be obtained by pushing the button on the red emergency phone beside the lift.",
  "parking": "Permit parking is available for the underground parking garage on Union Street west of the building and the surface lot on Albert Street. There are 3 accessible meter spots on Alfred Street at Union Street.",
  "desc_src": "https://www.queensu.ca/encyclopedia/m/mackintosh-corry-hall",
  "access": [
    "The building is large and comprised of six wings labeled A through F. There are a number of external building entrances, three of which are accessible:",
    "Ramps: There is a ramp on the main floor of the building outside of classroom B201.",
    " "
  ],
  "map": "https://goo.gl/maps/6z9wnCPdEWJPQc5x9"
}
