{"name": "McLaughlin Hall", "coords": [44.2237196, -76.4954176], "addr": "130 Stuart Street", "images": ["./public/images/buildings/mclaughlin-hall-0.jpg"], "alts": ["[photo of McLaughlin Hall]"], "desc": ["", "McLaughlin Hall was completed in 1948 as a home for the Department of Mechanical Engineering (see Materials and Metallurgical Engineering, Department of) and was built on the old site of the Observatory. There is a story that Chancellor Dunning procured the funds for the building merely by passing a note down the table at a board meeting of the CPR to his friend Col. R.S. McLaughlin, which said: \"Queen's needs a new mechanical engineering building.\"", "The building was expanded in 1960 and renovated in 1978, and both the original construction and the later improvements were financed by Col. R.S. McLaughlin and the McLaughlin Foundation.", "The building officially opened on November 15, 1948 and is named in honour of Col. R.S. McLaughlin."], "desc_src": "https://www.queensu.ca/encyclopedia/m/mclaughlin-hall", "access": ["Location: McLaughlin Hall is located on Stuart Street at the corner of Lower University Avenue.  ", "Entrances", "North (main)\nThe main entrance to McLaughlin Hall has several steps leading up to it and is not accessible.", "South\nThe rear building entrance at the northeast corner of the parking lot near the \"blue light\" security phone is accessible. The door is heavy but there is an automatic opener. Safety Note: The threshold is uneven. Note: This entrance is open from 8:00 a.m. to 6:00 p.m. Card access is required after 6:00 p.m. \nSafety Warning: Southeast Ramp: The concrete ramp with railings at the southeast corner of McLaughlin Hall near Lower University Avenue is not a wheelchair ramp.  ", "Corridors: There are doors in corridors to act as barriers that do not have operator buttons. There are no lifts or ramps in corridors.", "Elevators: There is an elevator accessible to all building levels. It is small (67” wide and 68” long) and may require backing into (door is 34”). The elevator buttons are not in Braille. There is no announcer. The elevator is not mirrored. Safety Note: Make sure the elevator floor is level with the lobby floor before entering or leaving the elevator. ", "Wayfinding: The signage for this building is located on the left hand-side of the main entrance at the top of the stairs beside the doors.", "Washrooms: There is a women’s accessible single-user washroom on level 1 near the elevator, and a male/female single-user accessible washroom on level 4 next to the main stair case. There are inaccessible single-user bathrooms on levels 2 (next to room 216) and 3 (next to room 318). There are male and female single-user washrooms on level 1 near the elevator, and a single-user accessible washroom on level 4 next to the main stair case. There is a male multi-user accessible washroom without power door by the elevator. There are inaccessible female single-user and male multi-user washrooms on levels 2 (next to room 216) and 3.  All-gender washrooms: B9, 403, 218A", "Services: There is an assistance telephone on level 2, next to room 248 by the main stair case. ", "Classrooms: Check the classroom website for the accessibility of McLaughlin Hall's classrooms.", "Parking: A lock stone path between McLaughlin Hall and 140 Stuart Street leads from Stuart Street and the parking lot. Permit parking is available in the lot at the rear of the building. There are two accessible meter spaces on the north side of Stuart Street opposite the underground parking garage entrance.", "Water Fountain: There is an accessible water fountain with bottle fill station across from room 219. ", " ", "Link to McLaughlin Hall on the Queen's Campus Map", "Link to McLaughlin Hall on Google Maps", "McLaughlin Hall Floor Plans", "McLaughlin Hall Site Plans"], "map": "https://goo.gl/maps/LiuxhYm6dCeoagRo8"}