{"name": "Bruce Wing", "coords": [44.227084000000005, -76.49313946992564], "addr": "13 Fifth Field", "images": [{"src": "/images/buildings/miller-hall-0.jpg", "alt": "[photo of Miller Hall, 1936]"}, {"src": "/images/buildings/miller-hall-1.jpg", "alt": "[photo of Miller Hall's Bruce Wing in 1973]"}], "desc": ["Miller Hall, 1936. Courtesy John H. Park.", "Built in 1931 and substantially enlarged in 1973, Miller Hall is named after Willet Green Miller, a professor of Geology and Petrology at Queen's and Ontario's chief Geologist (1902-1925), and is home to the Department of Geological Sciences and Geological Engineering.", "It is located on Union Street opposite the foot of Division Street.", "The building, constructed in the Collegiate Gothic style, also contains the Miller Museum of Geology. The Bruce Wing, built in 1973, is attached to the southwest corner of Miller Hall. It is named after Everend Lester Bruce, a Professor of Geology at Queen's (1914-1949) and head of the department (1944-1949).", "Bruce Wing, 1973", "The land currently occupied by the Bruce Wing was the location of Queen's first skating rink, which burned down in the 1920s (see Fires). The parking lot behind Miller Hall and part of the land occupied by Humphrey Hall held the Jock Harty Arena from 1922 to 1958."], "location": "Bruce Wing is located on Fifth Field Company Lane across from Division Street. The building is linked to Miller Hall at its North East corner.", "entrances": ["North/West\nThe main entrance is not accessible, there is a large set of stairs leading up to the entrance with handrails in the middle and on both sides.", "Parking: Permit parking is available in the lot behind Miller Hall and Bruce Wing. There is one accessible metered space on Union Street across the North-West corner of Miller Hall."], "corridors": "There are doors that act as barriers in corridors. Other barriers are some protrusions such as glass cabinets and furniture. ", "wayfinding": "", "washrooms": "There are no accessible washrooms in Bruce Wing. To access washrooms users must travel to Miller Hall which joins Bruce Wing. Accessible washrooms in Miller Hall are located on the second level for Male and the first level for Female.  All gender washroom: 537A", "fountains": "There is an accessible bottle fill station in the basement lobby and on the second floor.", "classrooms": "", "elevators": "The elevator allows access to all floors of Bruce Wing. ", "services": "", "parking": "", "desc_src": "https://www.queensu.ca/encyclopedia/m/miller-hall", "access": [], "map": "https://goo.gl/maps/xGKnY7FrQva2mMeX9"}