{"name": "Mitchell Hall", "coords": ["44.2281845", "-76.4943832"], "addr": "69 Union Street", "images": [{"src": "/images/buildings/mitchell-hall.jpg", "alt": "Street view of Mitchell Hall."}], "desc": ["", "Built upon the former footprint (brownfield site) of the Physical and Health Education Centre (PEC) and Jock Harty Arena, Mitchell Hall's doors opened in December 2018, with three gymnasiums, two multi-purpose classrooms, and the new Examination Centre made available for students writing tests during the Fall Term exam period.", "Mitchell Hall is an $85 million project designed to bring every aspect of campus life together under one roof. This unique project supports increased innovation programming and leading-edge engineering research, alongside wellness facilities and services for students.", "Located at the corner of Union and Division streets on the former site of the Physical Education Centre, Mitchell Hall was made possible through over $50 million in philanthropic support. The federal and Ontario governments also contributed $22 million to the project.", "Mitchell Hall is home to three modern teaching studios used by undergraduates in the Faculty of Engineering and Applied Science. Additionally, it is home to leading resources to support interdisciplinary research into human-machine interaction, along with new laboratories to support collaborative research in the field of freshwater resources (visit the Beaty Water Research Centre website for more details).", "Couple these facilities and a learning commons for mechanical engineering students together with a rapid prototyping and testing lab, and Mitchell Hall significantly enhances the academic experience for Queen’s engineering students and Queen’s research capabilities.", "Mechanical Engineering students gain a learning commons, new laboratories, and a rapid prototyping and testing lab in Mitchell Hall", "With the addition of a makerspace, group work rooms, a flat floor workshop studio, an event room, and a shared work area, it is expected that the number of students supported by the Dunin-Deshpande Queen’s Innovation Centre will double in the years ahead.", "Mitchell Hall provides ‘common shelter’ for student-facing innovation and entrepreneurship activities on campus, and it bolsters the linkages with The Isabel Bader Centre for the Performing Arts and with Innovation Park to further student and community entrepreneurship. Ultimately, these additions enable students to scale their budding businesses without leaving campus.", "The Innovation Hub features an event space for programming and student-led conferences.", "Mitchell Hall also includes space for the Queen’s University International Centre, a wellness centre, an expanded Chaplaincy with a new interfaith room, space for Student Community Relations, an office that helps students with off-campus housing issues, ample seating and lounge spaces on all floors, and a retail food outlet.", "Student wellness is top of mind in Mitchell Hall with refreshed space for Counselling and Health Services, the Peer Health Educators program, an Examination Centre, a multi-faith chapel (pictured), and more.", "Queen’s prides itself on providing an enriching and supportive living and learning environment for its students, and recognizes the critical importance of wellness for full participation in university life. Mitchell Hall features additional athletics and recreation facilities, including a High Performance Training Centre that provides varsity student-athletes with consistent, all-day access to cutting-edge equipment and technology.", "In addition, the gymnasia help meet the demand for recreation and intramural programs, as well as provide space for local community groups to run their programming. Mitchell Hall takes Queen’s to the next level by providing many additional opportunities to integrate physical health in our students’ daily lives.", "Athletics and recreation received a boost with the re-opening of three gyms and the addition of a high-performance training centre for varsity athletes."], "desc_src": "https://www.queensu.ca/encyclopedia/m/mitchell-hall", "access": ["This building directory entry is under construction", " ", "Link to Mitchell Hall on the Queen's Campus Map", "Link to Mitchell Hall on Google Maps", "Mitchell Hall Floor Plans", "Mitchell Hall Site Plans"], "map": "https://goo.gl/maps/2J7xSSPw1gVJjnWZ7"}