{"name": "Nicol Hall", "coords": [44.227812, -76.4940647], "addr": "60 Union Street", "images": ["./public/images/buildings/nicol-hall-0.jpg"], "alts": ["[photo of Nicol Hall]"], "desc": ["", "Completed in 1912, Nicol Hall houses various Faculty of Engineering and Applied Science departments.", "During the First World War, the attic of Nicol Hall was used as an army barracks (see Wartime at Queen's).", "It is named after William Nicol, Queen's first professor of Metallurgy and Mining, and also the person who donated the funds for the building's construction.", "An addition to the rear of Nicol Hall was built in 1930 and extensively renovated in 1961.", "Nicol Hall, like Gordon Hall, is built on the site of an old practice field."], "desc_src": "https://www.queensu.ca/encyclopedia/n/nicol-hall", "access": ["Location: Nicol Hall is located on Union Street, east of Gordon Hall.", "Entrances", "North\nThe main entrance to Nicol Hall is not accessible.", "East\nThe accessible entrance to Nicol Hall is located on the east side of the building. A paved pathway leads to a door with an automatic opener. This is the lower level entrance of Nicol Hall.  ", "Corridors: There are no doors that act as barriers in corridors.", "Elevators: A small elevator (60” by 58”, with an entry way that is 36”) is located north of the accessible entrance. Front and rear elevator doors allow access to all levels of Nicol Hall. The elevator does not have an audible system nor is it mirrored. Buttons are in Braille on the inside of the elevator.", "Wayfinding: The signage for this building it to the right-side, wall mounted beside the main entrance.", "Washrooms: There are no accessible washrooms in Nicol Hall. There is a single-user non-accessible washroom on level 3, rooms 301 & 309.", "Services: There are assistance phones on levels 1, 2 and 3, by the elevator.", "Classrooms: Check the classroom website for the accessibility of Nicol Hall's classrooms.", "Parking: Permit parking is available at the parking lot behind Miller Hall and in front of School of Kinesiology on Division Street. There is one accessible metered space available on Union Street across from Miller Hall. ", "Water Fountain: There is an accessible water fountain and bottle fill station in the first-floor lobby.", " ", "Link to Nicol Hall on the Queen's Campus Map", "Link to Nicol Hall on Google Maps", "Nicol Hall Floor Plans", "Nicol Hall Site Plans"], "map": "https://goo.gl/maps/ibuxWHXBKaabomsp9"}