{"name": "Old Medical Building", "coords": ["44.22629995", "-76.49295723038507"], "addr": "50-B Arch Street", "images": [{"src": "/images/buildings/old-medical-building.jpg", "alt": "Street view of Old Medical Building."}], "desc": ["", "Completed in 1858, the Old Medical Building was the first permanent building on campus or elsewhere that was constructed by Queen's (Summerhill, the oldest building on campus, was originally a private home).", "The building was constructed to house Queen's Faculty of Medicine, which was founded in 1855. It was a simple, Georgian-style building, strategically located behind Summerhill by Queen's cost-conscious leaders \"so that no architectural ornament would be at all necessary.\" In fact, when Professor John Watson arrived at Queen's to take up his post in 1872, he commented that \"nothing short of inverted architectural genius could devise anything so irredeemably ugly.\"", "In 1880, the Old Medical Building was rented to the Royal College of Physicians and Surgeons at an annual cost of $1. This was Principal Grant's first step in re-uniting the Royal College - which had been the Queen's Medical Faculty until it separated in 1965 - with the University. In 1892, the re-unification became a reality, and in 1901 professors of Medicine put up $10,000 of their own money to add a third floor to the Old Medical Building.", "Since then, it has undergone more major alterations than any other building on campus, the result of expansions, contractions, renovations, and a fire in 1924 that destroyed its top floor (which has since been rebuilt).", "But much of the original building, including its ornate doorway - the builders' only real concession to decoration - still stands.", "In addition to housing the medical faculty, the building has at different times held Queen's Convocation Hall, a primitive gymnasium, a small medical museum, a chapel, and a variety of Arts and Science classrooms.", "Today, the old spacious lecture rooms have been transformed into administrative offices.", "The building forms the west end of the Medical Quadrangle."], "desc_src": "https://www.queensu.ca/encyclopedia/o/old-medical-building", "access": ["Location: The Old Medical Building is located behind the Craine Building across the Medical Quadrangle.", "Entrances", "North/West\nThe accessible entrance is located at the northwest corner of the building along 5th Field Company Lane. There is a paving stone ramp that leads to a door with an automatic opener. Entrance is to level 1. It is the only wheelchair accessible level in the building.", "East\nThe main entrance to this building is not accessible due to stairs.", "Corridors: There are doors that act as barriers in the corridors. These doors do not have operator buttons.", "Wayfinding: The signage located to the left side of the main entrance doors, wall mounted.", "Washrooms: There is a male single-user accessible washroom and a female multi-user washroom located on level 1 near room 105.", "Parking: Permit parking is available on 5th Field Company Lane and the parking lot behind Kathleen Ryan Hall. There is one accessible meter space on Stuart Street in front of Botterell Hall. On street pay parking is available on Arch Street and Stuart Street.", " ", "Link to Old Medical Building on the Queen's Campus Map", "Link to Old Medical Building on Google Maps", "Old Medical Building Floor Plans", "Old Medical Building Site Plans"], "map": "https://goo.gl/maps/UR17QC3JztmkTvFC8"}