{"name": "Ontario Hall", "coords": ["44.226565", "-76.49509328441184"], "addr": "67 University Ave", "images": [{"src": "/images/buildings/ontario-hall.jpg", "alt": "Street view of Ontario Hall."}], "desc": ["", "Completed in 1903, this Victorian Romanesque building houses the Department of Art. Like nearby Kingston Hall, it was named for the level of government that funded it: it was built by the provincial government to house the Ontario School of Mining and Agriculture, which later became Queen's Faculty of Engineering and Applied Science.", "This building has served many different purposes over the years, being home at one time to the departments of Physics, Geology and Mineralogy (see Geological Sciences and Geological Engineering, Department of), Chemical Engineering, a School of Navigation, Geography, Mathematics and Statistics, and Fine Art, which it houses today. At one time, there was a post office located in the building and during WWI, the basement was used as a dining room for the Fifth Field Company of Canadian Engineers (see Wartime at Queen's). In the 1950s and 1960s, the basement held a sub-atomic particle accelerator and was fitted with a thick shield of concrete to contain the radiation that the accelerator produced.", "Today the building features several art studios, display rooms, the Art Library, and several small lecture halls.", "It is located beside Grant Hall on University Avenue."], "desc_src": "https://www.queensu.ca/encyclopedia/o/ontario-hall", "access": ["Location: Ontario Hall is located on University Avenue between Grant Hall and Douglas Library.  ", "Entrances", "East (accessible):\nA moderately sloped concrete ramp leads to the accessible entrance with a power door on the east side of the building along the southern stairway entrance which opens into the basement level. Safety note: the threshold of this entrance is uneven.", "West (main):\nThis main entrance on the west side of the building is only enterable by a curved staircase upwards to the main level of the building or a staircase in the middle to the basement level.", "Corridors: There are doors that act as barriers in the corridors that do not have power door operator buttons.", "Elevators: The elevator is located in the middle of the building and allows access to all levels of the building. There is no braille, nor mirrored walls or much room within.", "Wayfinding: There is small signage beside the main and alternative entrances.", "Washrooms: There are dedicated male and female multi-user accessible washrooms on the second floor, however they do not have power door operators to enter.", "Classrooms: Check the classroom website for the accessibility of Ontario Hall classrooms.", "Parking: Permit parking is available adjacent to the building, on 5th Field Company Lane and in the parking lot behind Kingston Hall.  There are three accessible meter spaces on the north side of Stuart Street opposite the Underground Parking Garage entrance.", "Water Fountain: There is an accessible water fountain with a bottle fill station in the first-floor lobby.", " ", "Link to Ontario Hall on the Queen's Campus Map", "Link to Ontario Hall on Google Maps", "Ontario Hall Floor Plans", "Ontario Hall Site Plans"], "map": "https://goo.gl/maps/nmrpH3x88RZXD2oM9"}