{"name": "Richardson Hall", "coords": ["44.226844", "-76.496059256"], "addr": "74 University Avenue", "images": [{"src": "/images/buildings/richardson-hall.jpg", "alt": "Street view of Richardson Hall."}], "desc": ["", "Richardson Hall was completed in 1954 specifically as an administration building. It was considered necessary because the administrative offices had long been located in Douglas Library and were causing a great deal of congestion in that already busy building.", "It is named after James Armstrong Richardson, a graduate of Queen's, a prominent Canadian businessman, and Chancellor of the university from 1929-1939.", "When the building opened, it caused quite the scandal because of its perceived excessive luxury. W.E. McNeill, the retired Vice Principal and Treasurer, wrote that \"the splendour of the administration building, especially its furnishings, is the topic of gossip. Two rooms have broadloom carpets from wall to wall; all offices have rugs and drapes.\" Even Principal Mackintosh was said to be uncomfortable in such opulence.", "In addition to its main function, Richardson Hall served at one time as the home of the Queen's Post Office, the Maintenance Department, and the offices of the Faculties of Arts and Science and Applied Science.", "The building was renovated in 2008.", "It now houses the Principal's Office, the offices of several Vice-Principals, and the University Secretariat."], "desc_src": "https://www.queensu.ca/encyclopedia/r/richardson-hall", "access": ["Location: Richardson Hall is located on University Avenue between Dunning and Ellis Halls.", "Entrances", "East\nThere is a main entrance at the front of the building that has stairs leading up to it to the first level, and also a ground level entrance that is accessible with an automatic door opener.", "West\nThe rear entrance does not have an automatic door opener. Richardson Hall level 2 can be accessed from Mackintosh-Corry Hall level 4.", "Corridors: There are no doors in corridors that act as barriers.", "Elevators: The elevator is located near the front entrance and accesses all levels of the building. It measures 65” by 84” and has an entrance of 42”. The elevator is equipped with audible announcements and Braille. It is not mirrored.", "Wayfinding: The signage for this building is wall mounted beside the main entrance that enters onto level 1.", "Washrooms: There are accessible washrooms on all levels of the building. All washroom doors have door operator buttons. However, there are no single-user washrooms in Richardson Hall.", "Parking: Permit parking is available for the underground parking garage on Union Street west of the building and the surface lot on Albert Street. A ramp located between Mackintosh-Corry Hall and Robert Sutherland Hall leads through Richardson Hall courtyard to University Avenue and the front entrance to Richardson Hall. There are 3 accessible meter spaces on Alfred Street at Union Street, and one in across from Gordon Hall on Union Street.  ", " ", "Link to Richardson Hall on the Queen's Campus Map", "Link to Richardson Hall on Google Maps", "Richardson Hall Floor Plans", "Richardson Hall Site Plans", " ", " "], "map": "https://goo.gl/maps/ugbfWBBNXCut2C2C7"}