{"name": "Richardson Lab", "coords": [44.2243287, -76.4936688], "addr": "76 Stuart Street", "images": ["./public/images/buildings/richardson-laboratory-0.jpg"], "alts": ["[photo of Richardson Laboratory]"], "desc": ["", "Located beside Etherington Hall, the Richardson Laboratory was completed in 1925 for the joint benefit of Queen's University and the Kingston General Hospital. The money for the construction was provided by the Richardson family, especially by Mrs. H. W. Richardson, who expanded on a gift left by her late husband.", "In 1962, a large addition and an extra floor were added."], "desc_src": "https://www.queensu.ca/encyclopedia/r/richardson-laboratory", "access": ["Location: Richardson Laboratory is located on Stuart Street between the Kingston General Hospital and Etherington Hall.", "Entrances", "North\nThe main entrance to Richardson Laboratory is a level entrance with an automatic door opener. The entry level of the building is level 2.", "Alternative Entrances\nYou can access Richardson Lab from KGH Douglas Wing, Etherington Hall and the Underground Parking Garage.", "Corridors: There are doors that act as barriers in the corridors of Richardson Laboratory. They are not operator button equipped.", "Elevators: The elevator is in the lobby adjacent to the main entrance. It measures 63” wide and 105” long, with an entrance of 45”. The elevator is not equipped with an audible announcement system, Braille buttons or mirrors.", "Wayfinding: The signage for this building is wall mounted to the left of the main entrance doors.", "Washrooms: Single-user male and female designated accessible washrooms are in the lobby on level 2, and 4. There is a single-user accessible washroom on level 5. There are no automatic door openers. Single-user male and female designated inaccessible washrooms can be found on level 3,4, and 5. There are multi-user male and female accessible washrooms without power door opener on level 1 near the tunnel entrance and Etherington Hall.", "Services: Graphic floor plans of the building are located on levels 1 and 2 near the elevator.", "Classrooms: Check the classroom website for the accessibility of Richardson Laboratory's classrooms.", "Parking: Permit parking is available in the lot behind McLaughlin Hall (enter from Lower University Avenue). There are three accessible meter spaces on the north side of Stuart Street. The underground parking garage is located across the street, accessing Richardson Laboratory by a tunnel under Stuart Street", " ", "Link to Richardson Laboratory on the Queen's Campus Map", "Link to Richardson Lab on Google Maps", "Richardson Lab Floor Plans", "Richardson Lab Site Plans"], "map": "https://goo.gl/maps/7mULWg5nB6jr7UTg6"}