{"name": "Robert Sutherland Hall", "coords": [44.2273131, -76.4975687], "addr": "138 Union Street", "images": ["./public/images/buildings/robert-sutherland-hall-0.jpg"], "alts": ["[photo of Robert Sutherland Hall]"], "desc": ["", "Robert Sutherland Hall was constructed in 1989 in order to house the growing number of departments and institutes at Queen's concerned with the study of politics and governmental issues under one roof.", "In February 2009, responding to an initiative proposed by the Rector, the Alma Mater Society President, the Society of Graduate and Professional Students President, and the Undergraduate Student Trustee, the Board of Trustees approved the naming dedication of the Policy Studies Building in honour of Robert Sutherland.", "Robert Sutherland was Canada's first known university student, graduate, and lawyer of colour, and the university's first major benefactor during a time of financial crisis (see Commercial Bank of the Midland District).", "Robert Sutherland Hall is home to the School of Policy Studies, the School of Urban and Regional Planning, the Industrial Relations Centre, the Centre for International and Defence Policy, and the Institute of Intergovernmental Relations."], "desc_src": "https://www.queensu.ca/encyclopedia/r/robert-sutherland-hall", "access": ["Location: Robert Sutherland Hall is located on Union Street between the Law Building and Tindall Field.", "Entrances", "North\nThe main (north lobby) entrance of Robert Sutherland Hall on Union Street is accessible and enters the building's lobby. This is the building’s second level. There is an automatic door opener. Conference room 202 is off the main lobby.", "South\nThe outdoor ramps that give access to Dunning Hall and Mackintosh Corry Hall connect to form a network of long narrow, moderately inclined concrete ramps. If followed in its entirety, the ramp that begins from Dunning Hall leads to the south lobby entrance of Robert Sutherland Hall with power door. The Southeastern entrance to the building is not accessible.", "West\nThere are two entrances to the building near Tindall Field, but only the northwest entrance is accessible. It is equipped with a power door opener", "Interior links through Mackintosh Corry Hall\nThere are interior links to Robert Sutherland Hall levels 3, 4 and 5 from Mackintosh-Corry Hall levels C3, C4, and C5, respectively. There are no automatic door openers at any of these links.", " ", "Corridors: There are doors that act as barriers in the corridors on the 1st and 2nd floors only. They are not equipped with operator buttons.", "Elevators: An elevator through an inaccessible door (no operator button) past the main lobby gives access to all levels of the building. It measures 51” by 68” with an opening of 36”. The elevator is not equipped with an audible announcement system, Braille buttons nor is it mirror lined.", "Wayfinding: The signage for this building is outside the front entrance facing Union Street.", "Washrooms: Accessible multi-user washrooms without power doors are located in the lobby area of conference room 202 (through the double-doors off of the main lobby). Accessible multi-user washrooms are also located on levels 3, 4, and 5 without power doors except level 5 male washroom. There is a single-user inaccessible washroom on the second floor beside the elevator. Single user washrooms: 191, 291.", "Services: There is an assistance phone in the lobby on level 2.", "Classrooms: Check the classroom website for the accessibility of Robert Sutherland Hall classrooms.", "Parking: Permit parking is available at the underground parking garage on Union Street under Tindall Field and the surface lot. There are 3 accessible meter spots on Alfred Street at Union Street.", "Water Fountain: There is an accessible water fountain with bottle fill station in the lobby on level 2.", " ", "Link to Robert Sutherland Hall on the Queen's Campus Map", "Link to Robert Sutherland Hall on Google Maps", "Robert Sutherland Hall Floor Plans", "Robert Sutherland Hall Site Plans"], "map": "https://goo.gl/maps/KSGnDB8mvSeoCTEt9"}