{"name": "New Medical Building", "coords": [44.225306, -76.4914231], "addr": "15 Arch Street (or) 80 Barrie Street", "images": ["./public/images/buildings/school-medicine-building-0.jpg"], "alts": ["School of Medicine Building"], "desc": ["", "Queen's $77 million School of Medicine building opened officially on September 22, 2011. The expanded facilities of the new School of Medicine enhance the education of our students and ultimately provide our region, province, and country with greater access to doctors.", "The new facility hosts a state-of-the-art teaching clinic, lecture halls and large teaching spaces, simulation labs, surgical/technical skills labs, small-group and seminar rooms, info-commons and virtual learning spaces, and student study spaces.", "The buildings architects are Diamond and Schmitt Architects (Toronto) and Shoalts and Zaback Architects Ltd. (Kingston). Federal and provincial governments invested $56-million in the building through the Canada-Ontario Knowledge Infrastructure Program.", "See also Abramsky House..."], "desc_src": "https://www.queensu.ca/encyclopedia/s/school-medicine-building", "access": ["Location: The New Medical Building is located south of Abramsky Hall on Barrie Street, across from Botterell Hall.", "Entrances", "South\nThe main entrance faces Stuart Street. It is accessible and equipped with power door and sensor.", "Alternative Entrances\nThere are entrances to the building from Arch Street behind the Cataraqui Building, next to Abramsky Hall, and on Barrier Street next to Abramsky House. Both are accessible with power doors.", "Corridors: There are doors in corridors to act as barriers. Some doors are without automatic openers. There are ramps on the corridor in level 1.", "Elevators: Both the North and South elevators are 66” wide and 92”, with entry ways that are 48” wide. These elevators are equipped with audible announcement systems and Braille buttons, but neither is lined with mirrors.", "Wayfinding: The signage for this building is wall mounted to the left of the main entrance doors.", "Washrooms: All floors have accessible washrooms. Multiuser washrooms are accessible and do not have exterior doors. In the basement there are single user accessible washrooms with power doors by both elevators. On the first floor single user washrooms with power door are available in by room 106, and single user washrooms without power door in room 113 and 111. There is a single-use Male and single-user female accessible washroom on level 2. There is one single user washroom/shower on the third floor without power door located by room 323.  ", "Services: Assistance telephones can be found on every floor.", "Parking: On-street parking is available on Arch Street, Barrie Street, and Stuart Street. Permit parking is available in the parking lot behind Humphrey Hall. There is one on street accessible parking spot on Stuart Street at the corner of George Street across from the main entrance.", "Water Fountain: There are is an accessible water fountain on level 1, outside of room 171.   ", " ", "Link to New Medical Building on the Queen's Campus Map", "Link to New Medical Building on Google Maps", "New Medical Building Floor Plans", "New Medical Building Site Plans"], "map": "https://goo.gl/maps/aLrt8ji1z6MHYKbd8"}