{"name": "Joseph S. Stauffer Library", "coords": ["44.2285235", "-76.49620158323691"], "addr": "101 Union Street", "images": [{"src": "/images/buildings/stauffer-library.jpg", "alt": "Street view of Joseph S. Stauffer Library."}], "desc": ["", "Opened in the fall of 1994, the five-storey Joseph S. Stauffer Library is the largest library on campus, with room for approximately 1.5 million volumes, six kilometres of bookstacks, and study and research space for more than 1,200 students.", "It is located on the northwest corner of University Avenue and Union Street.", "The library houses the university's humanities and social sciences collections and also contains state of the art computing and information services, seminar and training rooms, meeting rooms, maps, air photos, government documents, data collections, and the Union Gallery for art works by students.", "Stauffer Library is designed in neo-gothic style to match the style of Douglas Library and is clad in limestone. The $48-million facility was a Queen's Challenge Campaign initiative funded by the Ontario government and the private sector. The names of all the donors are recorded as part of a display in the main lobby of Stauffer Library.", "The library is named in honour of Joseph S. Stauffer, a graduate of Queen's (BSc 1920) and a generous benefactor. The largest donation toward the library came from his foundation, the Joseph S. Stauffer Foundation.", "In 1997, Stauffer Library was awarded the Governor General's Award for Architecture. The library was designed by Kuwabara Payne Mckenna Blumberg.", "Learn more about Stauffer Library..."], "desc_src": "https://www.queensu.ca/encyclopedia/s/stauffer-library", "access": ["Location: Stauffer Library is located at the northwest corner of University Avenue and Union Street.", "Entrances", "South/East: The main entrance to Stauffer Library is accessible with two automatic doors.", "South/West: The accessible entrance at Union Street near Alfred Street leads to the west end of the main lobby.", "Corridors: Colour floor plans are located in the library near the spiral staircase. There are some doors which act as barriers. Paths between shelves and study areas are often narrow or obstructed by chairs. Space between bookshelves is narrow but passable. The personnel at the circulation desk are available for help if required (e.g. reaching books).", "Elevators: The main elevator is located within the library west of the spiral staircase. Another elevator off the lobby only goes to the lower level.", "Washrooms: Accessible There are accessible washrooms on each floor of the library and also in the lobby near the elevator to lower level. Washrooms on ground and second floor levels are equipped with power door. There is a single-user accessible washroom on the ground level across the service de pas the security post (Room 179A). All gender washrooms: 179A, 582", "Services: The Accessible Services and Adaptive Technology Center is located within the library on the first floor. Library staff at the front desk are also available to assist in the library if required. The adaptive technology center or A.T.C is in Stauffer Library, room 120. The A.T.C includes Library Accessibility Services, an Adaptive Technology Lab, the Office of the Adaptive Technologist, and the Office of the Accessibility Coordinator. To obtain access to the Adaptive Technology Lab, students must first be registered at the Queen's Student Accessibility Services Office, La Salle Building, Stuart Street. The Lab is for the use of students with disabilities and their assistants. Students may obtain their own access card, from the office of the Adaptive Technologist, for use during the academic year.", "Parking: Permit parking is available in the unpaved lot north of the building and in the lots by Goodes Hall and Macintosh-Corry Hall. There are three accessible meter spots on Alfred Street at Union Street in front of the Southwest entrance", "Water Fountain: Accessible bottle fill stations are located on the main floor by the washrooms and on the 4th floor outside the men’s washrooms. Accessible water stations are available on each floor by the Northeastern washrooms.", " ", "Link to Stauffer Library on the Queen's Campus Map", "Link to Stauffer Library on Google Maps", "Stauffer Library Floor Plans", "Stauffer Library Site Plans", " "], "map": "https://goo.gl/maps/EWHnuKh1KMbc3hWf8"}