{"name": "Stirling Hall", "coords": ["44.224576850000005", "-76.49770221281332"], "addr": "64 Bader Lane", "images": [{"src": "/images/buildings/stirling-hall.jpg", "alt": "Street view of Stirling Hall."}], "desc": ["", "Built between 1962 and 1964, this distinctive round building located on Bader Lane was originally meant to be situated on the lower campus between Kingston General Hospital and Theological Hall. Well publicized protests from students, faculty, and alumni upset with the rapid pace of campus development, however, led to the preservation of that area as a green space.", "Students in particular were furious at the thought of losing the last large area of green space on the main campus. The Levana Society circulated petitions and protestors held a mock funeral for the lower campus, singing the \"Oil Thigh\" as a dirge and listening to a funeral oration given by a theology student. The Faculty Association, led by professor of history Arthur Lower, was also opposed to the idea and appealed to the administration for both practical and sentimental reasons to change their minds. The alumni were divided on the subject, with letters and phone calls pouring in, both to encourage the project and also to hail it as a disaster. The  Queen's Journal  were vehemently opposed to the proposition, publishing a much circulated editorial entitled \"The Rape of the Lower Campus.\"", "The dissatisfaction of so many members of the Queen's community did much to change the mind of Principal Mackintosh and the Trustees. In response to the protests, the university obtained options to buy five properties between Stuart Street and Queen's Crescent instead.", "A notable feature of the building is a Foucault Pendulum, which hangs in the centre of the second floor. The pendulum swings in a pattern and at a speed determined by the rotation of the earth and the latitude of Kingston.", "The building is named after John Bertram Stirling, a Queen's graduate, an engineer, and businessman of international repute, and eighth Chancellor of Queen's (1960-1974)."], "desc_src": "https://www.queensu.ca/encyclopedia/s/stirling-hall", "access": ["Location: Stirling Hall is located on Queen’s Crescent east of Chernoff Hall.", "Entrances", "North (main)\nThe main entrance is inaccessible due to a staircase leading up to the entrance.", "South\nThe accessible entrance is at the back of Stirling Hall facing the parking lot off Stuart Street and east of the Rideau Building. The door has an automatic opener and enters on level 1 (basement).  Please note: This door is locked at 5:00 p.m. on weekdays.", "Corridors: There are doors that act as barriers in the corridors. These doors do not have operator buttons. There are no lifts or ramps in corridors either.", "Elevators: There are two elevators: One is located on the 1st level, to the left once inside the accessible entrance. It serves the building periphery including the faculty offices on level 2. The other elevator serves the building core including lecture theatres A, B, C and D. To get to the core elevator proceed past the elevator near the accessible entrance, turn left and then right. Neither elevator is mirrored.\nTo access the lecture theatres, take the core elevator to level 2. Theatre A is on the left of the elevator, Theatres B and C are on the right and Theatre D is to the right then straight. The theatres are wheelchair accessible at the lecture podium level. Go through room 202 (audio visual room) to reach the wheelchair accessible area in Theatres B and C. Theatres B and C are closed to the public outside normal business hours.\nNote: The elevators require a key after normal business hours. Contact the Physics Department's general office to arrange for a key.", "Washrooms: An accessible single-user washroom is located on level 1 (basement), however, there are no door operator buttons. From the accessible entrance follow the hall around, at the southeast fire exit, turn left and follow the hallway to the end and turn right. When you get to the sign \"east corridor\" turn left and then make a right to the single-user accessible washrooms. Single user washrooms: 118, 135, 163, 205K.", "Services: There Students with classes in Stirling Hall can arrange a building tour and elevator key through the Physics Department's general office. There is an assistance phone in the front lobby of level 3.", "Classrooms: Check the classroom website for the accessibility of Stirling Hall classrooms.", "Parking: Permit parking is available in the lot behind Stirling Hall off Stuart Street, and on Queen's Crescent. Time-limited parking is available on St. Lawrence Avenue.", "Water Fountain: There is an accessible water fountain on level 5 (across from room 514). Accessible water fill stations are located on level 2 (next to room 203) and 3 (next to room 312).", " ", "Link to Stirling Hall on the Queen's Campus Map", "Link to Stirling Hall on Google Maps", "Stirling Hall Floor Plans", "Stirling Hall Site Plans"], "map": "https://goo.gl/maps/j9hazFGciTWn1LGb9"}