{"name": "Summerhill", "coords": [44.2259129, -76.492571], "addr": "55 Stuart Street", "images": ["./public/images/buildings/summerhill-0.jpg", "./public/images/buildings/summerhill-1.jpg"], "alts": ["[photo of Summerhill]", "[photo of the main entrance of Summerhill]"], "desc": ["", "The oldest building at Queen's, this graceful neoclassical villa was built as a private home for the local Anglican Archdeacon George Okill Stuart in 1839.", "Okill Stuart's father, Rev John Stuart, had been granted the 200-acre plot of land in 1785 in recognition of his status as Chaplain of the King's Royal Regiment, Bishop Emissary of the Church of England, and one of Kingston's most important United Empire Loyalist leaders. Upon his death in 1811, Okill Stuart inherited the plot, originally known as Lot 24.", "As it happened, Okill Stuart's family was not comfortable in the house - partly because a stream running through the basement made it depressingly damp - and they soon returned to their smaller and cosier home in downtown Kingston.", "In the early 1840s, when Kingston was the capital of Canada and parliament met across the road at Kingston General Hospital, Stuart rented the home to MPs. When the capital departed for Montreal in 1843, the Stuarts unwillingly moved back in.", "Finally, in 1853, the archdeacon sold the building to Queen's, which had been moving from one small rented house to another in Kingston since it was founded in 1841.", "Courtesy Hugh Douglas-Murray", "At first, Summerhill housed the entire university. But as Queen's grew, new buildings were built (such as the second-oldest building on campus, the Old Medical Building) to accommodate the university, and Summerhill came to serve more specialized purposes. At different times in its history it has housed students, professors, classrooms, laboratories, the medical school, a gymnasium of sorts, and the library, which dispensed the requested books through an outside window.", "Since the 1860s, it has been the Principal's official residence, although only the east wing is now designated for that purpose. Former Principal David Smith (1984-1994) was the first principal to maintain his actual residence elsewhere and to use Summerhill's east wing as accommodation for special guests of the university, for official dinners, and for receptions for honorary graduates and royal visitors.", "Summerhill was restored in 1984 and again in 2002 and is a designated Ontario historical site.", "In 2010, the east wing was officially renamed Agnes Benidickson House in honour of the former Chancellor (see Agnes Benidickson)."], "desc_src": "https://www.queensu.ca/encyclopedia/s/summerhill", "access": ["Location: Summerhill is located east of Theological Hall and faces Stuart Street and the Kingston General Hospital.  ", "Entrances", "North\nThere is a back entrance to Summerhill, but it is not accessible and often locked.", "South (main)\nThe main entrance to Summerhill is not accessible. There is a staircase up to the entrance.", "West (accessible)\nThe walkway on the west side of Summerhill leads to the accessible entrance, located on the terrace at the front of the west wing. It enters onto the 1st floor and Alumni Affairs Office. The entrance door does not have an automatic opener and the threshold is uneven. Assistance entering may be required.", "Corridors: There are some doors and narrow hallways. There is no barrier-free access to the lower or upper-level. ", "Wayfinding: The signage for this building is located on a freestanding sign on the left side of the main entrance.", "Washrooms: There is no designated accessible washroom at Summer Hill. An accessible washroom is in the Alumni Affairs Office.", "Parking: Permit parking is available 5th field company lane and parking lots behind Kingston Hall and Kathleen Ryan Hall. One accessible meter space is located on Stuart Street at George Street, and three spaces are on Stuart Street opposite the Nixon Field underground parking garage entrance.", " ", "Link to Summerhill on the Queen's Campus Map", "Link to Summerhill on Google Maps", "Floor Plans - N/A", "Summerhill Site Plans"], "map": "https://goo.gl/maps/VkLh9nzzH8up9X6MA"}