{"name": "Theological Hall", "coords": ["44.2255937", "-76.4934084"], "addr": "85 Stuart Street", "images": [{"src": "/images/buildings/theological-hall.jpg", "alt": "Street view of Theological Hall."}], "desc": ["", "Constructed in 1879-1880, Theological Hall is the third oldest building on campus and houses the School of Religion (see Religion and Religious Studies) and the Department of Drama.", "It was built with money donated by the citizens of Kingston in the first of what would be many hugely successful fundraising campaigns led by Principal George Grant. The mayor of Kingston \"handed over\" the building to Principal Grant in the opening ceremonies as a symbol of the goodwill between Queen's and Kingston.", "The Norman Romanesque structure was the university's main building throughout the late 19th century. When it was first built, faculty and students referred to the building as \"The College.\" Its spacious rooms housed all Arts and Science classes and its ornate Convocation Hall was used for Queen's major ceremonies as well as regular Sunday church services.", "The rounded west end of the building was the university's library until the early 1900s and remained the medical library until Botterell Hall was built in the 1970s. Today, the old library and Convocation Hall are theatres. On the second floor of the building is the intimate Morgan Memorial Chapel, named after the late theology professor William Morgan and used for regular services. Hundreds of alumni have been married in the chapel.", "", "The building became known as the \"Old Arts Building\" around the turn of the century and Kingston Hall, built in 1903, was the \"New Arts Building.\" Although it officially became Theological Hall in 1912 when Queen's Theological College was established and the university separated from the Presbyterian Church, it continued to be widely called the Old Arts Building until the 1970s.", "In the early 1930's, after a fire in Kingston Hall, the citizens of Kingston donated a sum of money not only to repair Kingston Hall, but also to fireproof Theological Hall and make sure a similar disaster would not strike again.", "The building is set back from Stuart Street and overlooks the lower campus and Kingston General Hospital. Its cornerstone was laid by the Marquis of Lorne, Governor General of Canada, and his wife Princess Louise, fourth daughter of Queen Victoria."], "desc_src": "https://www.queensu.ca/encyclopedia/t/theological-hall", "access": ["Location: Theological Hall faces Stuart Street and is located between Summerhill and Kingston Hall.", "Entrances", "North (accessible)\nThe rear entrance to Theological Hall which faces north is accessible. There is a short ramp with a railing on one side. There is also a powered door.", "South (main)\nThe main entrance that faces south is inaccessible, there are several steps leading up to the entranceway.", "South/West\nAccess to the Rotunda Theatre is possible by making previous arrangements with the Drama Department at 613-533-2104. The accessible entrance is located at the southwest corner of the building which gives access to the stage floor area only.", "Chapel\nThe chapel is accessible by taking the elevator to the 2nd level.", "Corridors: There are doors that act as barriers in the corridors that do not have operator buttons.", "Elevators: The elevator is located near the rear entrance next to the assistance phone. It is small (60” wide by 60” long) and may require backing into (entrance is 36”). The elevator buttons are not available in Braille. From the accessible entrance proceed through the lobby to the hallway on the other side of the staircase to the elevator. The elevator is not mirrored, there is no audible announcement system.", "Lifts: The 3rd floor reading room is accessible by taking the elevator to the 4th level, proceeding to room 415 then taking a one-person wheelchair lift. A number code is required to operate the lift. Students can obtain this code and user information from Health & Wellness Services", "Washrooms: There is one single-user accessible washroom with no power door on the first floor. It is to the left side of the main entrance. Single-user bathrooms that are inaccessible can be found in the basement, first floor to the right of the main entrance, levels 2, and 4. Single-user washrooms: 103, 105, 120, 121, 207/208, 217", "Services: The assistance phone is located near the rear entrance next to the elevator, in the vestibule on level 1.", "Classrooms: Check the classroom website for the accessibility of Theological Hall's classrooms.", "Parking: Permit parking is available near the back of the building. There is one accessible metered parking across Miller Hall on Union Street and three spaces on Stuart Street across the entrance to the underground parking garage.", "Water Fountain: There is an accessible water fountain with a bottle fill station across from room 102.", " ", "Link to Theological Hall on the Queen's Campus Map", "Link to Theological Hall on Google Maps", "Theological Hall Floor Plans", "Theological Hall Site Plans"], "map": "https://goo.gl/maps/VoBGEaQTCERrViVZ7"}