{"name": "The University Club", "coords": [44.2234221, -76.4966325], "addr": "168 Stuart Street", "images": ["./public/images/buildings/university-club-queens-0.jpg"], "alts": ["[photo of the University Club]"], "desc": ["", "Called the Faculty Club until 1994, this social club offers year-round facilities for dining and relaxing for members and their guests. Faculty, administrators, alumni, and full-time staff are eligible to join and the club's facilities are also available to non-members for catered special events.", "Officially a non-profit corporation, the club's full name is the University Club at Queen's, Inc. It was founded as the Faculty Club in 1949 and first met in the Students' Memorial Union (now the John Deutsch University Centre). In 1969 it moved to its present home, a striking waterfront house at 168 Stuart Street.", "The main part of this house was built in 1845 by prominent Kingston architect William Coverdale as a country home for a wealthy Kingstonian, the Rev William Macauley Herchmer, who called it St Lawrence Cottage. A later owner substantially altered the building in 1934, creating its present exterior appearance and room layout.", "A large addition was built at the rear of the building in 1968-69 to accommodate the Faculty Club. In 1994, following a trend in similar university clubs across Canada, the club changed its name and also broadened membership eligibility to include all full-time staff.", "Learn more about the University Club..."], "desc_src": "https://www.queensu.ca/encyclopedia/u/university-club-queens", "access": ["Location: The University Club is set back from the street at 168 Stuart and fronts onto King Street at number 143. The building can be approached from King Street up a sloping walkway, or from Stuart Street.", "Entrances", "North (Main entrance):\nThe accessible main entrance is located on Stuart Street with an automatic door opener. There is a ramp from the front door to the patio area.", "South (Accessible entrance):\nThe entrance from the patio to the north wing of the University Club is by a short plywood ramp. The door does not have an automatic opener.", "Corridors: There are doors that act as barriers in the corridors.", "Elevators: The elevator is 60” wide and 76” long. The door opening is 40”. There are no audible announcements or Braille buttons. The elevator is not mirrored.", "Ramps: No interior ramps, just the exterior ones mentioned above.", "Wayfinding: The signage for this building is located on a sign beside the main entranceway.", "Washrooms: There are no single-user accessible washrooms in the building. There are two designated accessible washrooms on levels 1 & 2, one male and one female.", "Services: A wheelchair is available at the club or visitors if needed. Staff at the University Club are available to assist users and more information can be found on their website. More specific information about accessibility at the club can be found on their accessibility page.", "Parking: Permit parking, including two accessible spaces, is available at the University Club parking lot on Stuart Street. There is time-limited parking on Stuart Street, St. Lawrence Avenue, and King Street south of the University Club.", " ", "Link to The University Club on the Queen's Campus Map", "Link to The University Club on Google Maps", "University Club Floor Plans - N/A", "University Club Site Plans"], "map": "https://goo.gl/maps/EwqvJtrHundeE9iA8"}