{"name": "Walter Light Hall", "coords": [44.228026549999996, -76.49167595054546], "addr": "19 Union Street", "images": [{"src": "/images/buildings/walter-light-hall-0.jpg", "alt": "[photo of Walter Light Hall]"}], "desc": ["", "Walter Light Hall was built because of a 1983 study conducted on the campus, which attempted to discover the most urgent space requirements of the University. The study concluded that the Department of Electrical and Computer Engineering, which was at the time located in Fleming Hall, was by far the most over-crowded and was in desperate need of new facilities.", "The building was completed in 1989 and is connected to Goodwin Hall on every floor. It is named after Walter Light, former chair of Northern Telecom and chair of Queen's Board of Trustees from 1985 to 1990.", "It was made possible by a grant from the estate of the late Joseph S. Stauffer.", "It is located on the north side of Union Street between Barrie and Division Streets."], "desc_src": "https://www.queensu.ca/encyclopedia/w/walter-light-hall", "access": ["Location: Walter Light Hall is located on Union Street, east of Goodwin Hall. ", "Entrances", "South (Main):\nThe main entrance to Walter Light Hall faces Union Street and has a set of several steps leading up to the main doors. There is a hand-railing in the middle of the staircase and two cement ledges on the staircase ends.", "East (Accessible):\nThe accessible entrance to the ground level of Goodwin Hall is at the east-side of the building under the link to Walter Light Hall. The door has an automatic door opener. The pathway to this entrance is wide and slightly inclined and can be reached from Union Street.", "West (Accessible):\nThe accessible entrance to the ground floor of Walter Light Hall is located on the westside of the building under the link to Goodwin Hall. There is a steel door that does not have an automatic opener. Other floors of Walter Light Hall cannot be accessed from this entrance. The pathway from Union Street to this entrance is wide and slightly inclined.", "Other Entrances: Through Goodwin Hall’s Interior Links (No Power Door). Walter Light and Goodwin interior links join all levels of the two buildings except ground floors.", "Corridors: There are doors that act as barriers in the corridors.", "Elevators (located within Goodwin Hall): Walter Light Hall does not have an elevator. Goodwin Hall's elevator provides access to all levels of both buildings except the ground floor of Walter Light Hall. The elevator is located near the accessible ground level entrance door. It measures 52” wide and 80” long, with an opening of 42”. The elevator does not have buttons in Braille, an audible announcement system nor is it mirrored. ", "Wayfinding: The building sign is located on the right hand side of the building at the main entrance.", "Washrooms:\nFemale accessible: located on levels 3, 5, and 6 (No washrooms are equipped with operator buttons)\nMale accessible: located on levels 2, 4, and 7 (No washrooms are equipped with operator buttons)\nOther Washrooms: Accessible Goodwin Hall Washrooms: the accessible men's washroom is located on the ground level. The accessible women's washroom is located on the 2nd (main) level. No washrooms are equipped with operator buttons. \nAll gender washroom located on floor 1, room 197.", "Classrooms: Check the CTL classroom webpage for the accessibility of Walter Light Hall classrooms.", "Parking: Permit parking is available in the lot behind the Miller Hall. There is one accessible meter parking space across from Gordon Hall on Union Street.", " ", "Link to Walter Light Hall on the Queen's Campus Map", "Link to Walter Light Hall on Google Maps", "Walter Light Hall Floor Plans", "Walter Light Hall Site Plan"], "map": "https://goo.gl/maps/8ApwdnNKikR4wCkw5"}