{"name": "John Watson Hall", "coords": [44.2255212, -76.4977786], "addr": "49 Bader Lane", "images": ["./public/images/buildings/watson-hall-0.jpg"], "alts": ["[photo of Watson Hall]"], "desc": ["Completed in 1967, Watson Hall is named after John Watson (1847-1939), a professor of Philosophy at Queen's from 1872 until 1924 and Vice-Principal from 1901 to 1924.", "The concrete structure was the first at Queen's to be built without limestone facing and, as such, faced considerable hostility from traditionalists on campus when it was constructed.", "Watson Hall houses various Humanities departments, including Classics, History, English, and Philosophy."], "desc_src": "https://www.queensu.ca/encyclopedia/w/watson-hall", "access": ["Location: Watson Hall is located on the north side of Bader Lane between Harrison-LeCaine Hall and the Grey House (51 Bader Lane). The building is set back from the road.", "Entrances", "South\nThe main entrance is accessible with a level pathway and automatic door opener.", "Elevators: The elevator is in the lobby and makes all building levels accessible. The elevator controls are positioned high on the wall. It measures 46” by 68” with an entrance of 40”. The elevator has Braille buttons on the inside, tactile buttons on the outside, and an audible announcement system. It is not mirrored.", "Wayfinding: The signage for Watson Hall is located on the wall beside the front entrance on the left side.", "Washrooms: An accessible single-user washroom without power door is located on the main floor (room 146). It is between Male and Female inaccessible washrooms.   ", "Services: There is an assistance phone in the main lobby and an emergency assistance/distress phone in the basement corridor. Convex mirrors have been placed in corners in the basement for security.", "Classrooms: Check the classroom website for the accessibility of Watson Hall's classrooms.", "Parking: Permit parking is available on Bader Lane, in the lot behind Watson Hall and beside Victoria Hall. There are three accessible meter spaces on the north side of Stuart Street opposite the underground parking garage entrance.", "Water Fountain: There is an accessible water fountain with bottle fill station on level 1 outside of room 146.", " ", "Link to John Watson Hall on the Queen's Campus Map", "Link to John Watson Hall on Google Maps", "John Watson Hall Floor Plans", "John Watson Hall Site Plans"], "map": "https://goo.gl/maps/e2HAWWVsGWv4n35fA"}